cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define WDT_INTENSET	MMIO_REG(0x40001005, uint8_t)
#define WDT_INTENSET_EW	(1 << 0)

#define WDT_INTENSET_s    MMIO_REG(0x40001005, struct __struct_WDT_INTENSET)
struct __struct_WDT_INTENSET
{
  uint8_t ew : 1;
  uint8_t  : 7;
};

#define WDT_INTFLAG	MMIO_REG(0x40001006, uint8_t)
#define WDT_INTFLAG_EW	(1 << 0)

#define WDT_INTFLAG_s    MMIO_REG(0x40001006, struct __struct_WDT_INTFLAG)
struct __struct_WDT_INTFLAG
{
  uint8_t ew : 1;
  uint8_t  : 7;
};

#define WDT_STATUS	MMIO_REG(0x40001007, uint8_t)
#define WDT_STATUS_SYNCBUSY	(1 << 7)

#define WDT_STATUS_s    MMIO_REG(0x40001007, struct __struct_WDT_STATUS)
struct __struct_WDT_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define WDT_CLEAR	MMIO_REG(0x40001008, uint8_t)
#define WDT_CLEAR_CLEAR(x)	((x) << 0)
#define WDT_CLEAR_CLEAR_MSK	0x000000ff
#define WDT_CLEAR_CLEAR_VAL(x)	(((x) >> 0) & 0xff)

#define WDT_CLEAR_s    MMIO_REG(0x40001008, struct __struct_WDT_CLEAR)
struct __struct_WDT_CLEAR
{
  uint8_t clear : 8;
};

// 0x40001400 RTC_M0

#define RTC_M0_CTRL	MMIO_REG(0x40001400, uint16_t)
#define RTC_M0_CTRL_SWRST	(1 << 0)
#define RTC_M0_CTRL_ENABLE	(1 << 1)
#define RTC_M0_CTRL_MODE(x)	((x) << 2)
#define RTC_M0_CTRL_MODE_MSK	0x0000000c
#define RTC_M0_CTRL_MODE_VAL(x)	(((x) >> 2) & 0x3)
#define RTC_M0_CTRL_CLKREP	(1 << 6)
#define RTC_M0_CTRL_MATCHCLR	(1 << 7)
#define RTC_M0_CTRL_PRESCALER(x)	((x) << 8)
#define RTC_M0_CTRL_PRESCALER_MSK	0x00000f00
#define RTC_M0_CTRL_PRESCALER_VAL(x)	(((x) >> 8) & 0xf)

#define RTC_M0_CTRL_s    MMIO_REG(0x40001400, struct __struct_RTC_M0_CTRL)
struct __struct_RTC_M0_CTRL
{
  uint16_t swrst : 1;
  uint16_t enable : 1;
  uint16_t mode : 2;
  uint16_t  : 3;
  uint16_t matchclr : 1;
  uint16_t prescaler : 4;
  uint16_t  : 4;
};

#define RTC_M0_READREQ	MMIO_REG(0x40001402, uint16_t)
#define RTC_M0_READREQ_ADDR(x)	((x) << 0)
#define RTC_M0_READREQ_ADDR_MSK	0x0000003f
#define RTC_M0_READREQ_ADDR_VAL(x)	(((x) >> 0) & 0x3f)
#define RTC_M0_READREQ_RCONT	(1 << 14)
#define RTC_M0_READREQ_RREQ	(1 << 15)

#define RTC_M0_READREQ_s    MMIO_REG(0x40001402, struct __struct_RTC_M0_READREQ)
struct __struct_RTC_M0_READREQ
{
  uint16_t addr : 6;
  uint16_t  : 8;
  uint16_t rcont : 1;
  uint16_t rreq : 1;
};

#define RTC_M0_EVCTRL	MMIO_REG(0x40001404, uint16_t)
#define RTC_M0_EVCTRL_PEREO0	(1 << 0)
#define RTC_M0_EVCTRL_PEREO1	(1 << 1)
#define RTC_M0_EVCTRL_PEREO2	(1 << 2)
#define RTC_M0_EVCTRL_PEREO3	(1 << 3)
#define RTC_M0_EVCTRL_PEREO4	(1 << 4)
#define RTC_M0_EVCTRL_PEREO5	(1 << 5)
#define RTC_M0_EVCTRL_PEREO6	(1 << 6)
#define RTC_M0_EVCTRL_PEREO7	(1 << 7)
#define RTC_M0_EVCTRL_CMPEO0	(1 << 8)
#define RTC_M0_EVCTRL_OVFEO	(1 << 15)

#define RTC_M0_EVCTRL_s    MMIO_REG(0x40001404, struct __struct_RTC_M0_EVCTRL)
struct __struct_RTC_M0_EVCTRL
{
  uint16_t pereo0 : 1;
  uint16_t pereo1 : 1;
  uint16_t pereo2 : 1;
  uint16_t pereo3 : 1;
  uint16_t pereo4 : 1;
  uint16_t pereo5 : 1;
  uint16_t pereo6 : 1;
  uint16_t pereo7 : 1;
  uint16_t cmpeo0 : 1;
  uint16_t  : 6;
  uint16_t ovfeo : 1;
};

#define RTC_M0_INTENCLR	MMIO_REG(0x40001406, uint8_t)
#define RTC_M0_INTENCLR_CMP0	(1 << 0)
#define RTC_M0_INTENCLR_SYNCRDY	(1 << 6)
#define RTC_M0_INTENCLR_OVF	(1 << 7)

#define RTC_M0_INTENCLR_s    MMIO_REG(0x40001406, struct __struct_RTC_M0_INTENCLR)
struct __struct_RTC_M0_INTENCLR
{
  uint8_t cmp0 : 1;
  uint8_t  : 5;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

#define RTC_M0_INTENSET	MMIO_REG(0x40001407, uint8_t)
#define RTC_M0_INTENSET_CMP0	(1 << 0)
#define RTC_M0_INTENSET_SYNCRDY	(1 << 6)
#define RTC_M0_INTENSET_OVF	(1 << 7)

#define RTC_M0_INTENSET_s    MMIO_REG(0x40001407, struct __struct_RTC_M0_INTENSET)
struct __struct_RTC_M0_INTENSET
{
  uint8_t cmp0 : 1;
  uint8_t  : 5;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

#define RTC_M0_INTFLAG	MMIO_REG(0x40001408, uint8_t)
#define RTC_M0_INTFLAG_CMP0	(1 << 0)
#define RTC_M0_INTFLAG_SYNCRDY	(1 << 6)
#define RTC_M0_INTFLAG_OVF	(1 << 7)

#define RTC_M0_INTFLAG_s    MMIO_REG(0x40001408, struct __struct_RTC_M0_INTFLAG)
struct __struct_RTC_M0_INTFLAG
{
  uint8_t cmp0 : 1;
  uint8_t  : 5;
  uint8_t syncrdy : 1;
  uint8_t ovf : 1;
};

#define RTC_M0_STATUS	MMIO_REG(0x4000140a, uint8_t)
#define RTC_M0_STATUS_SYNCBUSY	(1 << 7)

#define RTC_M0_STATUS_s    MMIO_REG(0x4000140a, struct __struct_RTC_M0_STATUS)
struct __struct_RTC_M0_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define RTC_M0_DBGCTRL	MMIO_REG(0x4000140b, uint8_t)
#define RTC_M0_DBGCTRL_DBGRUN	(1 << 0)

#define RTC_M0_DBGCTRL_s    MMIO_REG(0x4000140b, struct __struct_RTC_M0_DBGCTRL)
struct __struct_RTC_M0_DBGCTRL
{
  uint8_t dbgrun : 1;
  uint8_t  : 7;
};

#define RTC_M0_FREQCORR	MMIO_REG(0x4000140c, uint8_t)
#define RTC_M0_FREQCORR_VALUE(x)	((x) << 0)
#define RTC_M0_FREQCORR_VALUE_MSK	0x0000007f
#define RTC_M0_FREQCORR_VALUE_VAL(x)	(((x) >> 0) & 0x7f)
#define RTC_M0_FREQCORR_SIGN	(1 << 7)

#define RTC_M0_FREQCORR_s    MMIO_REG(0x4000140c, struct __struct_RTC_M0_FREQCORR)
struct __struct_RTC_M0_FREQCORR
{
  uint8_t value : 7;
  uint8_t sign : 1;
};

#define RTC_M0_COUNT	MMIO_REG(0x40001410, uint32_t)
#define RTC_M0_COUNT_COUNT(x)	((x) << 0)
#define RTC_M0_COUNT_COUNT_MSK	0xffffffff
#define RTC_M0_COUNT_COUNT_VAL(x)	(((x) >> 0) & 0xffffffff)

#define RTC_M0_COUNT_s    MMIO_REG(0x40001410, struct __struct_RTC_M0_COUNT)
struct __struct_RTC_M0_COUNT
{
  uint32_t count : 32;
};

#define RTC_M0_COMP0	MMIO_REG(0x40001418, uint32_t)
#define RTC_M0_COMP0_COMP(x)	((x) << 0)
#define RTC_M0_COMP0_COMP_MSK	0xffffffff
#define RTC_M0_COMP0_COMP_VAL(x)	(((x) >> 0) & 0xffffffff)

#define RTC_M0_COMP0_s    MMIO_REG(0x40001418, struct __struct_RTC_M0_COMP0)
struct __struct_RTC_M0_COMP0
{
  uint32_t comp : 32;
};

// 0x40001400 RTC_M1

#define RTC_M1_CTRL	MMIO_REG(0x40001400, uint16_t)
#define RTC_M1_CTRL_SWRST	(1 << 0)
#define RTC_M1_CTRL_ENABLE	(1 << 1)
#define RTC_M1_CTRL_MODE(x)	((x) << 2)
#define RTC_M1_CTRL_MODE_MSK	0x0000000c
#define RTC_M1_CTRL_MODE_VAL(x)	(((x) >> 2) & 0x3)
#define RTC_M1_CTRL_CLKREP	(1 << 6)
#define RTC_M1_CTRL_MATCHCLR	(1 << 7)
#define RTC_M1_CTRL_PRESCALER(x)	((x) << 8)
#define RTC_M1_CTRL_PRESCALER_MSK	0x00000f00
#define RTC_M1_CTRL_PRESCALER_VAL(x)	(((x) >> 8) & 0xf)

#define RTC_M1_CTRL_s    MMIO_REG(0x40001400, struct __struct_RTC_M1_CTRL)
struct __struct_RTC_M1_CTRL
{
  uint16_t swrst : 1;
  uint16_t enable : 1;
  uint16_t mode : 2;
  uint16_t  : 4;
  uint16_t prescaler : 4;
  uint16_t  : 4;
};

