cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define EIC_CONFIG1_s    MMIO_REG(0x4000181c, struct __struct_EIC_CONFIG1)
struct __struct_EIC_CONFIG1
{
  uint32_t sense8 : 3;
  uint32_t filten8 : 1;
  uint32_t sense9 : 3;
  uint32_t filten9 : 1;
  uint32_t sense10 : 3;
  uint32_t filten10 : 1;
  uint32_t sense11 : 3;
  uint32_t filten11 : 1;
  uint32_t sense12 : 3;
  uint32_t filten12 : 1;
  uint32_t sense13 : 3;
  uint32_t filten13 : 1;
  uint32_t sense14 : 3;
  uint32_t filten14 : 1;
  uint32_t sense15 : 3;
  uint32_t filten15 : 1;
};

// 0x41000000 PAC1

#define PAC1_WPCLR	MMIO_REG(0x41000000, uint32_t)
#define PAC1_WPCLR_DSU	(1 << 1)
#define PAC1_WPCLR_NVMCTRL	(1 << 2)
#define PAC1_WPCLR_PORT	(1 << 3)

#define PAC1_WPCLR_s    MMIO_REG(0x41000000, struct __struct_PAC1_WPCLR)
struct __struct_PAC1_WPCLR
{
  uint32_t  : 1;
  uint32_t dsu : 1;
  uint32_t nvmctrl : 1;
  uint32_t port : 1;
  uint32_t dmac : 1;
  uint32_t usb : 1;
  uint32_t mtb : 1;
  uint32_t  : 25;
};

#define PAC1_WPSET	MMIO_REG(0x41000004, uint32_t)
#define PAC1_WPSET_DSU	(1 << 1)
#define PAC1_WPSET_NVMCTRL	(1 << 2)
#define PAC1_WPSET_PORT	(1 << 3)

#define PAC1_WPSET_s    MMIO_REG(0x41000004, struct __struct_PAC1_WPSET)
struct __struct_PAC1_WPSET
{
  uint32_t  : 1;
  uint32_t dsu : 1;
  uint32_t nvmctrl : 1;
  uint32_t port : 1;
  uint32_t dmac : 1;
  uint32_t usb : 1;
  uint32_t mtb : 1;
  uint32_t  : 25;
};

// 0x41002000 DSU

#define DSU_CTRL	MMIO_REG(0x41002000, uint8_t)
#define DSU_CTRL_SWRST	(1 << 0)
#define DSU_CTRL_CRC	(1 << 2)
#define DSU_CTRL_MBIST	(1 << 3)
#define DSU_CTRL_CE	(1 << 4)

#define DSU_CTRL_s    MMIO_REG(0x41002000, struct __struct_DSU_CTRL)
struct __struct_DSU_CTRL
{
  uint8_t swrst : 1;
  uint8_t  : 1;
  uint8_t crc : 1;
  uint8_t mbist : 1;
  uint8_t ce : 1;
  uint8_t  : 3;
};

#define DSU_STATUSA	MMIO_REG(0x41002001, uint8_t)
#define DSU_STATUSA_DONE	(1 << 0)
#define DSU_STATUSA_CRSTEXT	(1 << 1)
#define DSU_STATUSA_BERR	(1 << 2)
#define DSU_STATUSA_FAIL	(1 << 3)
#define DSU_STATUSA_PERR	(1 << 4)

#define DSU_STATUSA_s    MMIO_REG(0x41002001, struct __struct_DSU_STATUSA)
struct __struct_DSU_STATUSA
{
  uint8_t done : 1;
  uint8_t crstext : 1;
  uint8_t berr : 1;
  uint8_t fail : 1;
  uint8_t perr : 1;
  uint8_t  : 3;
};

#define DSU_STATUSB	MMIO_REG(0x41002002, uint8_t)
#define DSU_STATUSB_PROT	(1 << 0)
#define DSU_STATUSB_DBGPRES	(1 << 1)
#define DSU_STATUSB_DCCD0	(1 << 2)
#define DSU_STATUSB_DCCD1	(1 << 3)
#define DSU_STATUSB_HPE	(1 << 4)

#define DSU_STATUSB_s    MMIO_REG(0x41002002, struct __struct_DSU_STATUSB)
struct __struct_DSU_STATUSB
{
  uint8_t prot : 1;
  uint8_t dbgpres : 1;
  uint8_t dccd0 : 1;
  uint8_t dccd1 : 1;
  uint8_t hpe : 1;
  uint8_t  : 3;
};

#define DSU_ADDR	MMIO_REG(0x41002004, uint32_t)
#define DSU_ADDR_ADDR(x)	((x) << 2)
#define DSU_ADDR_ADDR_MSK	0xfffffffc
#define DSU_ADDR_ADDR_VAL(x)	(((x) >> 2) & 0x3fffffff)

#define DSU_ADDR_s    MMIO_REG(0x41002004, struct __struct_DSU_ADDR)
struct __struct_DSU_ADDR
{
  uint32_t  : 2;
  uint32_t addr : 30;
};

#define DSU_LENGTH	MMIO_REG(0x41002008, uint32_t)
#define DSU_LENGTH_LENGTH(x)	((x) << 2)
#define DSU_LENGTH_LENGTH_MSK	0xfffffffc
#define DSU_LENGTH_LENGTH_VAL(x)	(((x) >> 2) & 0x3fffffff)

#define DSU_LENGTH_s    MMIO_REG(0x41002008, struct __struct_DSU_LENGTH)
struct __struct_DSU_LENGTH
{
  uint32_t  : 2;
  uint32_t length : 30;
};

#define DSU_DATA	MMIO_REG(0x4100200c, uint32_t)

#define DSU_DCC0	MMIO_REG(0x41002010, uint32_t)

#define DSU_DCC1	MMIO_REG(0x41002014, uint32_t)

#define DSU_DID	MMIO_REG(0x41002018, uint32_t)
#define DSU_DID_DVSEL(x)	((x) << 0)
#define DSU_DID_DVSEL_MSK	0x000000ff
#define DSU_DID_DVSEL_VAL(x)	(((x) >> 0) & 0xff)
#define DSU_DID_REVISION(x)	((x) << 8)
#define DSU_DID_REVISION_MSK	0x00000f00
#define DSU_DID_REVISION_VAL(x)	(((x) >> 8) & 0xf)
#define DSU_DID_DIE(x)	((x) << 12)
#define DSU_DID_DIE_MSK	0x0000f000
#define DSU_DID_DIE_VAL(x)	(((x) >> 12) & 0xf)
#define DSU_DID_SUBFAMILY(x)	((x) << 16)
#define DSU_DID_SUBFAMILY_MSK	0x00ff0000
#define DSU_DID_SUBFAMILY_VAL(x)	(((x) >> 16) & 0xff)
#define DSU_DID_FAMILY(x)	((x) << 24)
#define DSU_DID_FAMILY_MSK	0x0f000000
#define DSU_DID_FAMILY_VAL(x)	(((x) >> 24) & 0xf)
#define DSU_DID_PROCESSOR(x)	((x) << 28)
#define DSU_DID_PROCESSOR_MSK	0xf0000000
#define DSU_DID_PROCESSOR_VAL(x)	(((x) >> 28) & 0xf)

#define DSU_DID_s    MMIO_REG(0x41002018, struct __struct_DSU_DID)
struct __struct_DSU_DID
{
  uint32_t devsel : 8;
  uint32_t revision : 4;
  uint32_t die : 4;
  uint32_t series : 8;
  uint32_t family : 4;
  uint32_t processor : 4;
};

// 0x41004000 NVMCTRL

#define NVMCTRL_CTRLA	MMIO_REG(0x41004000, uint16_t)
#define NVMCTRL_CTRLA_CMD(x)	((x) << 0)
#define NVMCTRL_CTRLA_CMD_MSK	0x0000007f
#define NVMCTRL_CTRLA_CMD_VAL(x)	(((x) >> 0) & 0x7f)
#define NVMCTRL_CTRLA_CMDEX(x)	((x) << 8)
#define NVMCTRL_CTRLA_CMDEX_MSK	0x0000ff00
#define NVMCTRL_CTRLA_CMDEX_VAL(x)	(((x) >> 8) & 0xff)

#define NVMCTRL_CTRLA_s    MMIO_REG(0x41004000, struct __struct_NVMCTRL_CTRLA)
struct __struct_NVMCTRL_CTRLA
{
  uint16_t cmd : 7;
  uint16_t  : 1;
  uint16_t cmdex : 8;
};

#define NVMCTRL_CTRLB	MMIO_REG(0x41004004, uint32_t)
#define NVMCTRL_CTRLB_RWS(x)	((x) << 1)
#define NVMCTRL_CTRLB_RWS_MSK	0x0000001e
#define NVMCTRL_CTRLB_RWS_VAL(x)	(((x) >> 1) & 0xf)
#define NVMCTRL_CTRLB_MANW	(1 << 7)
#define NVMCTRL_CTRLB_SLEEPPRM(x)	((x) << 8)
#define NVMCTRL_CTRLB_SLEEPPRM_MSK	0x00000300
#define NVMCTRL_CTRLB_SLEEPPRM_VAL(x)	(((x) >> 8) & 0x3)
#define NVMCTRL_CTRLB_READMODE(x)	((x) << 16)
#define NVMCTRL_CTRLB_READMODE_MSK	0x00030000
#define NVMCTRL_CTRLB_READMODE_VAL(x)	(((x) >> 16) & 0x3)
#define NVMCTRL_CTRLB_CACHEDIS	(1 << 18)

#define NVMCTRL_CTRLB_s    MMIO_REG(0x41004004, struct __struct_NVMCTRL_CTRLB)
struct __struct_NVMCTRL_CTRLB
{
  uint32_t  : 1;
  uint32_t rws : 4;
  uint32_t  : 2;
  uint32_t manw : 1;
  uint32_t sleepprm : 2;
  uint32_t  : 6;
  uint32_t readmode : 2;
  uint32_t cachedis : 1;
  uint32_t  : 13;
};

#define NVMCTRL_PARAM	MMIO_REG(0x41004008, uint32_t)
#define NVMCTRL_PARAM_NVMP(x)	((x) << 0)
#define NVMCTRL_PARAM_NVMP_MSK	0x0000ffff
#define NVMCTRL_PARAM_NVMP_VAL(x)	(((x) >> 0) & 0xffff)
#define NVMCTRL_PARAM_PSZ(x)	((x) << 16)
#define NVMCTRL_PARAM_PSZ_MSK	0x00070000
#define NVMCTRL_PARAM_PSZ_VAL(x)	(((x) >> 16) & 0x7)

