cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define PORTA_IN	MMIO_REG(0x41004420, int32_t)
#define PORTA_IN_P0	(1 << 0)
#define PORTA_IN_P1	(1 << 1)
#define PORTA_IN_P2	(1 << 2)
#define PORTA_IN_P3	(1 << 3)
#define PORTA_IN_P4	(1 << 4)
#define PORTA_IN_P5	(1 << 5)
#define PORTA_IN_P6	(1 << 6)
#define PORTA_IN_P7	(1 << 7)
#define PORTA_IN_P8	(1 << 8)
#define PORTA_IN_P9	(1 << 9)
#define PORTA_IN_P10	(1 << 10)
#define PORTA_IN_P11	(1 << 11)
#define PORTA_IN_P12	(1 << 12)
#define PORTA_IN_P13	(1 << 13)
#define PORTA_IN_P14	(1 << 14)
#define PORTA_IN_P15	(1 << 15)
#define PORTA_IN_P16	(1 << 16)
#define PORTA_IN_P17	(1 << 17)
#define PORTA_IN_P18	(1 << 18)
#define PORTA_IN_P19	(1 << 19)
#define PORTA_IN_P20	(1 << 20)
#define PORTA_IN_P21	(1 << 21)
#define PORTA_IN_P22	(1 << 22)
#define PORTA_IN_P23	(1 << 23)
#define PORTA_IN_P24	(1 << 24)
#define PORTA_IN_P25	(1 << 25)
#define PORTA_IN_P26	(1 << 26)
#define PORTA_IN_P27	(1 << 27)
#define PORTA_IN_P28	(1 << 28)
#define PORTA_IN_P29	(1 << 29)
#define PORTA_IN_P30	(1 << 30)
#define PORTA_IN_P31	(1 << 31)

#define PORTA_IN_s    MMIO_REG(0x41004420, struct __struct_PORTA_IN)
struct __struct_PORTA_IN
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTA_CTRL	MMIO_REG(0x41004424, int32_t)

#define PORTA_WRCONFIG	MMIO_REG(0x41004428, int32_t)
#define PORTA_WRCONFIG_PINMASK(x)	((x) << 0)
#define PORTA_WRCONFIG_PINMASK_MSK	0x0000ffff
#define PORTA_WRCONFIG_PINMASK_VAL(x)	(((x) >> 0) & 0xffff)
#define PORTA_WRCONFIG_PMUXEN	(1 << 16)
#define PORTA_WRCONFIG_INEN	(1 << 17)
#define PORTA_WRCONFIG_PULLEN	(1 << 18)
#define PORTA_WRCONFIG_PMUX(x)	((x) << 24)
#define PORTA_WRCONFIG_PMUX_MSK	0x0f000000
#define PORTA_WRCONFIG_PMUX_VAL(x)	(((x) >> 24) & 0xf)
#define PORTA_WRCONFIG_WRPMUX	(1 << 28)
#define PORTA_WRCONFIG_WRPINCFG	(1 << 30)
#define PORTA_WRCONFIG_HWSEL	(1 << 31)

#define PORTA_WRCONFIG_s    MMIO_REG(0x41004428, struct __struct_PORTA_WRCONFIG)
struct __struct_PORTA_WRCONFIG
{
  uint32_t pinmask : 16;
  uint32_t pmuxen : 1;
  uint32_t inen : 1;
  uint32_t pullen : 1;
  uint32_t  : 5;
  uint32_t pmux : 4;
  uint32_t wrpmux : 1;
  uint32_t  : 1;
  uint32_t wrpincfg : 1;
  uint32_t hwsel : 1;
};

#define PORTA_PMUX0	MMIO_REG(0x41004430, uint8_t)
#define PORTA_PMUX0_PMUXE(x)	((x) << 0)
#define PORTA_PMUX0_PMUXE_MSK	0x0000000f
#define PORTA_PMUX0_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX0_PMUXO(x)	((x) << 4)
#define PORTA_PMUX0_PMUXO_MSK	0x000000f0
#define PORTA_PMUX0_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX0_s    MMIO_REG(0x41004430, struct __struct_PORTA_PMUX0)
struct __struct_PORTA_PMUX0
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX1	MMIO_REG(0x41004431, uint8_t)
#define PORTA_PMUX1_PMUXE(x)	((x) << 0)
#define PORTA_PMUX1_PMUXE_MSK	0x0000000f
#define PORTA_PMUX1_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX1_PMUXO(x)	((x) << 4)
#define PORTA_PMUX1_PMUXO_MSK	0x000000f0
#define PORTA_PMUX1_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX1_s    MMIO_REG(0x41004431, struct __struct_PORTA_PMUX1)
struct __struct_PORTA_PMUX1
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX2	MMIO_REG(0x41004432, uint8_t)
#define PORTA_PMUX2_PMUXE(x)	((x) << 0)
#define PORTA_PMUX2_PMUXE_MSK	0x0000000f
#define PORTA_PMUX2_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX2_PMUXO(x)	((x) << 4)
#define PORTA_PMUX2_PMUXO_MSK	0x000000f0
#define PORTA_PMUX2_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX2_s    MMIO_REG(0x41004432, struct __struct_PORTA_PMUX2)
struct __struct_PORTA_PMUX2
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX3	MMIO_REG(0x41004433, uint8_t)
#define PORTA_PMUX3_PMUXE(x)	((x) << 0)
#define PORTA_PMUX3_PMUXE_MSK	0x0000000f
#define PORTA_PMUX3_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX3_PMUXO(x)	((x) << 4)
#define PORTA_PMUX3_PMUXO_MSK	0x000000f0
#define PORTA_PMUX3_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX3_s    MMIO_REG(0x41004433, struct __struct_PORTA_PMUX3)
struct __struct_PORTA_PMUX3
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX4	MMIO_REG(0x41004434, uint8_t)
#define PORTA_PMUX4_PMUXE(x)	((x) << 0)
#define PORTA_PMUX4_PMUXE_MSK	0x0000000f
#define PORTA_PMUX4_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX4_PMUXO(x)	((x) << 4)
#define PORTA_PMUX4_PMUXO_MSK	0x000000f0
#define PORTA_PMUX4_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX4_s    MMIO_REG(0x41004434, struct __struct_PORTA_PMUX4)
struct __struct_PORTA_PMUX4
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX5	MMIO_REG(0x41004435, uint8_t)
#define PORTA_PMUX5_PMUXE(x)	((x) << 0)
#define PORTA_PMUX5_PMUXE_MSK	0x0000000f
#define PORTA_PMUX5_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX5_PMUXO(x)	((x) << 4)
#define PORTA_PMUX5_PMUXO_MSK	0x000000f0
#define PORTA_PMUX5_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX5_s    MMIO_REG(0x41004435, struct __struct_PORTA_PMUX5)
struct __struct_PORTA_PMUX5
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX6	MMIO_REG(0x41004436, uint8_t)
#define PORTA_PMUX6_PMUXE(x)	((x) << 0)
#define PORTA_PMUX6_PMUXE_MSK	0x0000000f
#define PORTA_PMUX6_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX6_PMUXO(x)	((x) << 4)
#define PORTA_PMUX6_PMUXO_MSK	0x000000f0
#define PORTA_PMUX6_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX6_s    MMIO_REG(0x41004436, struct __struct_PORTA_PMUX6)
struct __struct_PORTA_PMUX6
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX7	MMIO_REG(0x41004437, uint8_t)
#define PORTA_PMUX7_PMUXE(x)	((x) << 0)
#define PORTA_PMUX7_PMUXE_MSK	0x0000000f
#define PORTA_PMUX7_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX7_PMUXO(x)	((x) << 4)
#define PORTA_PMUX7_PMUXO_MSK	0x000000f0
#define PORTA_PMUX7_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX7_s    MMIO_REG(0x41004437, struct __struct_PORTA_PMUX7)
struct __struct_PORTA_PMUX7
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX8	MMIO_REG(0x41004438, uint8_t)
#define PORTA_PMUX8_PMUXE(x)	((x) << 0)
#define PORTA_PMUX8_PMUXE_MSK	0x0000000f
#define PORTA_PMUX8_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX8_PMUXO(x)	((x) << 4)
#define PORTA_PMUX8_PMUXO_MSK	0x000000f0
#define PORTA_PMUX8_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX8_s    MMIO_REG(0x41004438, struct __struct_PORTA_PMUX8)
struct __struct_PORTA_PMUX8
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTA_PMUX9	MMIO_REG(0x41004439, uint8_t)
#define PORTA_PMUX9_PMUXE(x)	((x) << 0)
#define PORTA_PMUX9_PMUXE_MSK	0x0000000f
#define PORTA_PMUX9_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTA_PMUX9_PMUXO(x)	((x) << 4)
#define PORTA_PMUX9_PMUXO_MSK	0x000000f0
#define PORTA_PMUX9_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTA_PMUX9_s    MMIO_REG(0x41004439, struct __struct_PORTA_PMUX9)
struct __struct_PORTA_PMUX9
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

