cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define PORTB_DIRSET_s    MMIO_REG(0x41004488, struct __struct_PORTB_DIRSET)
struct __struct_PORTB_DIRSET
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_DIRTGL	MMIO_REG(0x4100448c, int32_t)
#define PORTB_DIRTGL_P0	(1 << 0)
#define PORTB_DIRTGL_P1	(1 << 1)
#define PORTB_DIRTGL_P2	(1 << 2)
#define PORTB_DIRTGL_P3	(1 << 3)
#define PORTB_DIRTGL_P4	(1 << 4)
#define PORTB_DIRTGL_P5	(1 << 5)
#define PORTB_DIRTGL_P6	(1 << 6)
#define PORTB_DIRTGL_P7	(1 << 7)
#define PORTB_DIRTGL_P8	(1 << 8)
#define PORTB_DIRTGL_P9	(1 << 9)
#define PORTB_DIRTGL_P10	(1 << 10)
#define PORTB_DIRTGL_P11	(1 << 11)
#define PORTB_DIRTGL_P12	(1 << 12)
#define PORTB_DIRTGL_P13	(1 << 13)
#define PORTB_DIRTGL_P14	(1 << 14)
#define PORTB_DIRTGL_P15	(1 << 15)
#define PORTB_DIRTGL_P16	(1 << 16)
#define PORTB_DIRTGL_P17	(1 << 17)
#define PORTB_DIRTGL_P18	(1 << 18)
#define PORTB_DIRTGL_P19	(1 << 19)
#define PORTB_DIRTGL_P20	(1 << 20)
#define PORTB_DIRTGL_P21	(1 << 21)
#define PORTB_DIRTGL_P22	(1 << 22)
#define PORTB_DIRTGL_P23	(1 << 23)
#define PORTB_DIRTGL_P24	(1 << 24)
#define PORTB_DIRTGL_P25	(1 << 25)
#define PORTB_DIRTGL_P26	(1 << 26)
#define PORTB_DIRTGL_P27	(1 << 27)
#define PORTB_DIRTGL_P28	(1 << 28)
#define PORTB_DIRTGL_P29	(1 << 29)
#define PORTB_DIRTGL_P30	(1 << 30)
#define PORTB_DIRTGL_P31	(1 << 31)

#define PORTB_DIRTGL_s    MMIO_REG(0x4100448c, struct __struct_PORTB_DIRTGL)
struct __struct_PORTB_DIRTGL
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_OUT	MMIO_REG(0x41004490, int32_t)
#define PORTB_OUT_P0	(1 << 0)
#define PORTB_OUT_P1	(1 << 1)
#define PORTB_OUT_P2	(1 << 2)
#define PORTB_OUT_P3	(1 << 3)
#define PORTB_OUT_P4	(1 << 4)
#define PORTB_OUT_P5	(1 << 5)
#define PORTB_OUT_P6	(1 << 6)
#define PORTB_OUT_P7	(1 << 7)
#define PORTB_OUT_P8	(1 << 8)
#define PORTB_OUT_P9	(1 << 9)
#define PORTB_OUT_P10	(1 << 10)
#define PORTB_OUT_P11	(1 << 11)
#define PORTB_OUT_P12	(1 << 12)
#define PORTB_OUT_P13	(1 << 13)
#define PORTB_OUT_P14	(1 << 14)
#define PORTB_OUT_P15	(1 << 15)
#define PORTB_OUT_P16	(1 << 16)
#define PORTB_OUT_P17	(1 << 17)
#define PORTB_OUT_P18	(1 << 18)
#define PORTB_OUT_P19	(1 << 19)
#define PORTB_OUT_P20	(1 << 20)
#define PORTB_OUT_P21	(1 << 21)
#define PORTB_OUT_P22	(1 << 22)
#define PORTB_OUT_P23	(1 << 23)
#define PORTB_OUT_P24	(1 << 24)
#define PORTB_OUT_P25	(1 << 25)
#define PORTB_OUT_P26	(1 << 26)
#define PORTB_OUT_P27	(1 << 27)
#define PORTB_OUT_P28	(1 << 28)
#define PORTB_OUT_P29	(1 << 29)
#define PORTB_OUT_P30	(1 << 30)
#define PORTB_OUT_P31	(1 << 31)

#define PORTB_OUT_s    MMIO_REG(0x41004490, struct __struct_PORTB_OUT)
struct __struct_PORTB_OUT
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTB_OUTCLR	MMIO_REG(0x41004494, int32_t)
#define PORTB_OUTCLR_P0	(1 << 0)
#define PORTB_OUTCLR_P1	(1 << 1)
#define PORTB_OUTCLR_P2	(1 << 2)
#define PORTB_OUTCLR_P3	(1 << 3)
#define PORTB_OUTCLR_P4	(1 << 4)
#define PORTB_OUTCLR_P5	(1 << 5)
#define PORTB_OUTCLR_P6	(1 << 6)
#define PORTB_OUTCLR_P7	(1 << 7)
#define PORTB_OUTCLR_P8	(1 << 8)
#define PORTB_OUTCLR_P9	(1 << 9)
#define PORTB_OUTCLR_P10	(1 << 10)
#define PORTB_OUTCLR_P11	(1 << 11)
#define PORTB_OUTCLR_P12	(1 << 12)
#define PORTB_OUTCLR_P13	(1 << 13)
#define PORTB_OUTCLR_P14	(1 << 14)
#define PORTB_OUTCLR_P15	(1 << 15)
#define PORTB_OUTCLR_P16	(1 << 16)
#define PORTB_OUTCLR_P17	(1 << 17)
#define PORTB_OUTCLR_P18	(1 << 18)
#define PORTB_OUTCLR_P19	(1 << 19)
#define PORTB_OUTCLR_P20	(1 << 20)
#define PORTB_OUTCLR_P21	(1 << 21)
#define PORTB_OUTCLR_P22	(1 << 22)
#define PORTB_OUTCLR_P23	(1 << 23)
#define PORTB_OUTCLR_P24	(1 << 24)
#define PORTB_OUTCLR_P25	(1 << 25)
#define PORTB_OUTCLR_P26	(1 << 26)
#define PORTB_OUTCLR_P27	(1 << 27)
#define PORTB_OUTCLR_P28	(1 << 28)
#define PORTB_OUTCLR_P29	(1 << 29)
#define PORTB_OUTCLR_P30	(1 << 30)
#define PORTB_OUTCLR_P31	(1 << 31)

#define PORTB_OUTCLR_s    MMIO_REG(0x41004494, struct __struct_PORTB_OUTCLR)
struct __struct_PORTB_OUTCLR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

