cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define PORTB_PMUX1	MMIO_REG(0x410044b1, uint8_t)
#define PORTB_PMUX1_PMUXE(x)	((x) << 0)
#define PORTB_PMUX1_PMUXE_MSK	0x0000000f
#define PORTB_PMUX1_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX1_PMUXO(x)	((x) << 4)
#define PORTB_PMUX1_PMUXO_MSK	0x000000f0
#define PORTB_PMUX1_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX1_s    MMIO_REG(0x410044b1, struct __struct_PORTB_PMUX1)
struct __struct_PORTB_PMUX1
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX2	MMIO_REG(0x410044b2, uint8_t)
#define PORTB_PMUX2_PMUXE(x)	((x) << 0)
#define PORTB_PMUX2_PMUXE_MSK	0x0000000f
#define PORTB_PMUX2_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX2_PMUXO(x)	((x) << 4)
#define PORTB_PMUX2_PMUXO_MSK	0x000000f0
#define PORTB_PMUX2_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX2_s    MMIO_REG(0x410044b2, struct __struct_PORTB_PMUX2)
struct __struct_PORTB_PMUX2
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX3	MMIO_REG(0x410044b3, uint8_t)
#define PORTB_PMUX3_PMUXE(x)	((x) << 0)
#define PORTB_PMUX3_PMUXE_MSK	0x0000000f
#define PORTB_PMUX3_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX3_PMUXO(x)	((x) << 4)
#define PORTB_PMUX3_PMUXO_MSK	0x000000f0
#define PORTB_PMUX3_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX3_s    MMIO_REG(0x410044b3, struct __struct_PORTB_PMUX3)
struct __struct_PORTB_PMUX3
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX4	MMIO_REG(0x410044b4, uint8_t)
#define PORTB_PMUX4_PMUXE(x)	((x) << 0)
#define PORTB_PMUX4_PMUXE_MSK	0x0000000f
#define PORTB_PMUX4_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX4_PMUXO(x)	((x) << 4)
#define PORTB_PMUX4_PMUXO_MSK	0x000000f0
#define PORTB_PMUX4_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX4_s    MMIO_REG(0x410044b4, struct __struct_PORTB_PMUX4)
struct __struct_PORTB_PMUX4
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX5	MMIO_REG(0x410044b5, uint8_t)
#define PORTB_PMUX5_PMUXE(x)	((x) << 0)
#define PORTB_PMUX5_PMUXE_MSK	0x0000000f
#define PORTB_PMUX5_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX5_PMUXO(x)	((x) << 4)
#define PORTB_PMUX5_PMUXO_MSK	0x000000f0
#define PORTB_PMUX5_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX5_s    MMIO_REG(0x410044b5, struct __struct_PORTB_PMUX5)
struct __struct_PORTB_PMUX5
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX6	MMIO_REG(0x410044b6, uint8_t)
#define PORTB_PMUX6_PMUXE(x)	((x) << 0)
#define PORTB_PMUX6_PMUXE_MSK	0x0000000f
#define PORTB_PMUX6_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX6_PMUXO(x)	((x) << 4)
#define PORTB_PMUX6_PMUXO_MSK	0x000000f0
#define PORTB_PMUX6_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX6_s    MMIO_REG(0x410044b6, struct __struct_PORTB_PMUX6)
struct __struct_PORTB_PMUX6
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX7	MMIO_REG(0x410044b7, uint8_t)
#define PORTB_PMUX7_PMUXE(x)	((x) << 0)
#define PORTB_PMUX7_PMUXE_MSK	0x0000000f
#define PORTB_PMUX7_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX7_PMUXO(x)	((x) << 4)
#define PORTB_PMUX7_PMUXO_MSK	0x000000f0
#define PORTB_PMUX7_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX7_s    MMIO_REG(0x410044b7, struct __struct_PORTB_PMUX7)
struct __struct_PORTB_PMUX7
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX8	MMIO_REG(0x410044b8, uint8_t)
#define PORTB_PMUX8_PMUXE(x)	((x) << 0)
#define PORTB_PMUX8_PMUXE_MSK	0x0000000f
#define PORTB_PMUX8_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX8_PMUXO(x)	((x) << 4)
#define PORTB_PMUX8_PMUXO_MSK	0x000000f0
#define PORTB_PMUX8_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX8_s    MMIO_REG(0x410044b8, struct __struct_PORTB_PMUX8)
struct __struct_PORTB_PMUX8
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX9	MMIO_REG(0x410044b9, uint8_t)
#define PORTB_PMUX9_PMUXE(x)	((x) << 0)
#define PORTB_PMUX9_PMUXE_MSK	0x0000000f
#define PORTB_PMUX9_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX9_PMUXO(x)	((x) << 4)
#define PORTB_PMUX9_PMUXO_MSK	0x000000f0
#define PORTB_PMUX9_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX9_s    MMIO_REG(0x410044b9, struct __struct_PORTB_PMUX9)
struct __struct_PORTB_PMUX9
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX10	MMIO_REG(0x410044ba, uint8_t)
#define PORTB_PMUX10_PMUXE(x)	((x) << 0)
#define PORTB_PMUX10_PMUXE_MSK	0x0000000f
#define PORTB_PMUX10_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX10_PMUXO(x)	((x) << 4)
#define PORTB_PMUX10_PMUXO_MSK	0x000000f0
#define PORTB_PMUX10_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX10_s    MMIO_REG(0x410044ba, struct __struct_PORTB_PMUX10)
struct __struct_PORTB_PMUX10
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX11	MMIO_REG(0x410044bb, uint8_t)
#define PORTB_PMUX11_PMUXE(x)	((x) << 0)
#define PORTB_PMUX11_PMUXE_MSK	0x0000000f
#define PORTB_PMUX11_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX11_PMUXO(x)	((x) << 4)
#define PORTB_PMUX11_PMUXO_MSK	0x000000f0
#define PORTB_PMUX11_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX11_s    MMIO_REG(0x410044bb, struct __struct_PORTB_PMUX11)
struct __struct_PORTB_PMUX11
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX12	MMIO_REG(0x410044bc, uint8_t)
#define PORTB_PMUX12_PMUXE(x)	((x) << 0)
#define PORTB_PMUX12_PMUXE_MSK	0x0000000f
#define PORTB_PMUX12_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX12_PMUXO(x)	((x) << 4)
#define PORTB_PMUX12_PMUXO_MSK	0x000000f0
#define PORTB_PMUX12_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX12_s    MMIO_REG(0x410044bc, struct __struct_PORTB_PMUX12)
struct __struct_PORTB_PMUX12
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX13	MMIO_REG(0x410044bd, uint8_t)
#define PORTB_PMUX13_PMUXE(x)	((x) << 0)
#define PORTB_PMUX13_PMUXE_MSK	0x0000000f
#define PORTB_PMUX13_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX13_PMUXO(x)	((x) << 4)
#define PORTB_PMUX13_PMUXO_MSK	0x000000f0
#define PORTB_PMUX13_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

#define PORTB_PMUX13_s    MMIO_REG(0x410044bd, struct __struct_PORTB_PMUX13)
struct __struct_PORTB_PMUX13
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTB_PMUX14	MMIO_REG(0x410044be, uint8_t)
#define PORTB_PMUX14_PMUXE(x)	((x) << 0)
#define PORTB_PMUX14_PMUXE_MSK	0x0000000f
#define PORTB_PMUX14_PMUXE_VAL(x)	(((x) >> 0) & 0xf)
#define PORTB_PMUX14_PMUXO(x)	((x) << 4)
#define PORTB_PMUX14_PMUXO_MSK	0x000000f0
#define PORTB_PMUX14_PMUXO_VAL(x)	(((x) >> 4) & 0xf)

