cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define PORTB_PINCFG15	MMIO_REG(0x410044cf, uint8_t)
#define PORTB_PINCFG15_PMUXEN	(1 << 0)
#define PORTB_PINCFG15_INEN	(1 << 1)
#define PORTB_PINCFG15_PULLEN	(1 << 2)

#define PORTB_PINCFG15_s    MMIO_REG(0x410044cf, struct __struct_PORTB_PINCFG15)
struct __struct_PORTB_PINCFG15
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG16	MMIO_REG(0x410044d0, uint8_t)
#define PORTB_PINCFG16_PMUXEN	(1 << 0)
#define PORTB_PINCFG16_INEN	(1 << 1)
#define PORTB_PINCFG16_PULLEN	(1 << 2)

#define PORTB_PINCFG16_s    MMIO_REG(0x410044d0, struct __struct_PORTB_PINCFG16)
struct __struct_PORTB_PINCFG16
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG17	MMIO_REG(0x410044d1, uint8_t)
#define PORTB_PINCFG17_PMUXEN	(1 << 0)
#define PORTB_PINCFG17_INEN	(1 << 1)
#define PORTB_PINCFG17_PULLEN	(1 << 2)

#define PORTB_PINCFG17_s    MMIO_REG(0x410044d1, struct __struct_PORTB_PINCFG17)
struct __struct_PORTB_PINCFG17
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG18	MMIO_REG(0x410044d2, uint8_t)
#define PORTB_PINCFG18_PMUXEN	(1 << 0)
#define PORTB_PINCFG18_INEN	(1 << 1)
#define PORTB_PINCFG18_PULLEN	(1 << 2)

#define PORTB_PINCFG18_s    MMIO_REG(0x410044d2, struct __struct_PORTB_PINCFG18)
struct __struct_PORTB_PINCFG18
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG19	MMIO_REG(0x410044d3, uint8_t)
#define PORTB_PINCFG19_PMUXEN	(1 << 0)
#define PORTB_PINCFG19_INEN	(1 << 1)
#define PORTB_PINCFG19_PULLEN	(1 << 2)

#define PORTB_PINCFG19_s    MMIO_REG(0x410044d3, struct __struct_PORTB_PINCFG19)
struct __struct_PORTB_PINCFG19
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG20	MMIO_REG(0x410044d4, uint8_t)
#define PORTB_PINCFG20_PMUXEN	(1 << 0)
#define PORTB_PINCFG20_INEN	(1 << 1)
#define PORTB_PINCFG20_PULLEN	(1 << 2)

#define PORTB_PINCFG20_s    MMIO_REG(0x410044d4, struct __struct_PORTB_PINCFG20)
struct __struct_PORTB_PINCFG20
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG21	MMIO_REG(0x410044d5, uint8_t)
#define PORTB_PINCFG21_PMUXEN	(1 << 0)
#define PORTB_PINCFG21_INEN	(1 << 1)
#define PORTB_PINCFG21_PULLEN	(1 << 2)

#define PORTB_PINCFG21_s    MMIO_REG(0x410044d5, struct __struct_PORTB_PINCFG21)
struct __struct_PORTB_PINCFG21
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG22	MMIO_REG(0x410044d6, uint8_t)
#define PORTB_PINCFG22_PMUXEN	(1 << 0)
#define PORTB_PINCFG22_INEN	(1 << 1)
#define PORTB_PINCFG22_PULLEN	(1 << 2)

#define PORTB_PINCFG22_s    MMIO_REG(0x410044d6, struct __struct_PORTB_PINCFG22)
struct __struct_PORTB_PINCFG22
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG23	MMIO_REG(0x410044d7, uint8_t)
#define PORTB_PINCFG23_PMUXEN	(1 << 0)
#define PORTB_PINCFG23_INEN	(1 << 1)
#define PORTB_PINCFG23_PULLEN	(1 << 2)

#define PORTB_PINCFG23_s    MMIO_REG(0x410044d7, struct __struct_PORTB_PINCFG23)
struct __struct_PORTB_PINCFG23
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG24	MMIO_REG(0x410044d8, uint8_t)
#define PORTB_PINCFG24_PMUXEN	(1 << 0)
#define PORTB_PINCFG24_INEN	(1 << 1)
#define PORTB_PINCFG24_PULLEN	(1 << 2)

#define PORTB_PINCFG24_s    MMIO_REG(0x410044d8, struct __struct_PORTB_PINCFG24)
struct __struct_PORTB_PINCFG24
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG25	MMIO_REG(0x410044d9, uint8_t)
#define PORTB_PINCFG25_PMUXEN	(1 << 0)
#define PORTB_PINCFG25_INEN	(1 << 1)
#define PORTB_PINCFG25_PULLEN	(1 << 2)

#define PORTB_PINCFG25_s    MMIO_REG(0x410044d9, struct __struct_PORTB_PINCFG25)
struct __struct_PORTB_PINCFG25
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG26	MMIO_REG(0x410044da, uint8_t)
#define PORTB_PINCFG26_PMUXEN	(1 << 0)
#define PORTB_PINCFG26_INEN	(1 << 1)
#define PORTB_PINCFG26_PULLEN	(1 << 2)

#define PORTB_PINCFG26_s    MMIO_REG(0x410044da, struct __struct_PORTB_PINCFG26)
struct __struct_PORTB_PINCFG26
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG27	MMIO_REG(0x410044db, uint8_t)
#define PORTB_PINCFG27_PMUXEN	(1 << 0)
#define PORTB_PINCFG27_INEN	(1 << 1)
#define PORTB_PINCFG27_PULLEN	(1 << 2)

#define PORTB_PINCFG27_s    MMIO_REG(0x410044db, struct __struct_PORTB_PINCFG27)
struct __struct_PORTB_PINCFG27
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG28	MMIO_REG(0x410044dc, uint8_t)
#define PORTB_PINCFG28_PMUXEN	(1 << 0)
#define PORTB_PINCFG28_INEN	(1 << 1)
#define PORTB_PINCFG28_PULLEN	(1 << 2)

#define PORTB_PINCFG28_s    MMIO_REG(0x410044dc, struct __struct_PORTB_PINCFG28)
struct __struct_PORTB_PINCFG28
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG29	MMIO_REG(0x410044dd, uint8_t)
#define PORTB_PINCFG29_PMUXEN	(1 << 0)
#define PORTB_PINCFG29_INEN	(1 << 1)
#define PORTB_PINCFG29_PULLEN	(1 << 2)

#define PORTB_PINCFG29_s    MMIO_REG(0x410044dd, struct __struct_PORTB_PINCFG29)
struct __struct_PORTB_PINCFG29
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG30	MMIO_REG(0x410044de, uint8_t)
#define PORTB_PINCFG30_PMUXEN	(1 << 0)
#define PORTB_PINCFG30_INEN	(1 << 1)
#define PORTB_PINCFG30_PULLEN	(1 << 2)

#define PORTB_PINCFG30_s    MMIO_REG(0x410044de, struct __struct_PORTB_PINCFG30)
struct __struct_PORTB_PINCFG30
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTB_PINCFG31	MMIO_REG(0x410044df, uint8_t)
#define PORTB_PINCFG31_PMUXEN	(1 << 0)
#define PORTB_PINCFG31_INEN	(1 << 1)
#define PORTB_PINCFG31_PULLEN	(1 << 2)

#define PORTB_PINCFG31_s    MMIO_REG(0x410044df, struct __struct_PORTB_PINCFG31)
struct __struct_PORTB_PINCFG31
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

