cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
// 0x41004500 PORTC

#define PORTC_DIR MMIO_REG(0x41004500, uint32_t)
#define PORTC_DIR_P0  (1 << 0)
#define PORTC_DIR_P1  (1 << 1)
#define PORTC_DIR_P2  (1 << 2)
#define PORTC_DIR_P3  (1 << 3)
#define PORTC_DIR_P4  (1 << 4)
#define PORTC_DIR_P5  (1 << 5)
#define PORTC_DIR_P6  (1 << 6)
#define PORTC_DIR_P7  (1 << 7)
#define PORTC_DIR_P8  (1 << 8)
#define PORTC_DIR_P9  (1 << 9)
#define PORTC_DIR_P10 (1 << 10)
#define PORTC_DIR_P11 (1 << 11)
#define PORTC_DIR_P12 (1 << 12)
#define PORTC_DIR_P13 (1 << 13)
#define PORTC_DIR_P14 (1 << 14)
#define PORTC_DIR_P15 (1 << 15)
#define PORTC_DIR_P16 (1 << 16)
#define PORTC_DIR_P17 (1 << 17)
#define PORTC_DIR_P18 (1 << 18)
#define PORTC_DIR_P19 (1 << 19)
#define PORTC_DIR_P20 (1 << 20)
#define PORTC_DIR_P21 (1 << 21)
#define PORTC_DIR_P22 (1 << 22)
#define PORTC_DIR_P23 (1 << 23)
#define PORTC_DIR_P24 (1 << 24)
#define PORTC_DIR_P25 (1 << 25)
#define PORTC_DIR_P26 (1 << 26)
#define PORTC_DIR_P27 (1 << 27)
#define PORTC_DIR_P28 (1 << 28)
#define PORTC_DIR_P29 (1 << 29)
#define PORTC_DIR_P30 (1 << 30)
#define PORTC_DIR_P31 (1 << 31)

#define PORTC_DIR_s    MMIO_REG(0x41004500, struct __struct_PORTC_DIR)
struct __struct_PORTC_DIR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTC_DIRCLR  MMIO_REG(0x41004504, uint32_t)
#define PORTC_DIRCLR_P0 (1 << 0)
#define PORTC_DIRCLR_P1 (1 << 1)
#define PORTC_DIRCLR_P2 (1 << 2)
#define PORTC_DIRCLR_P3 (1 << 3)
#define PORTC_DIRCLR_P4 (1 << 4)
#define PORTC_DIRCLR_P5 (1 << 5)
#define PORTC_DIRCLR_P6 (1 << 6)
#define PORTC_DIRCLR_P7 (1 << 7)
#define PORTC_DIRCLR_P8 (1 << 8)
#define PORTC_DIRCLR_P9 (1 << 9)
#define PORTC_DIRCLR_P10  (1 << 10)
#define PORTC_DIRCLR_P11  (1 << 11)
#define PORTC_DIRCLR_P12  (1 << 12)
#define PORTC_DIRCLR_P13  (1 << 13)
#define PORTC_DIRCLR_P14  (1 << 14)
#define PORTC_DIRCLR_P15  (1 << 15)
#define PORTC_DIRCLR_P16  (1 << 16)
#define PORTC_DIRCLR_P17  (1 << 17)
#define PORTC_DIRCLR_P18  (1 << 18)
#define PORTC_DIRCLR_P19  (1 << 19)
#define PORTC_DIRCLR_P20  (1 << 20)
#define PORTC_DIRCLR_P21  (1 << 21)
#define PORTC_DIRCLR_P22  (1 << 22)
#define PORTC_DIRCLR_P23  (1 << 23)
#define PORTC_DIRCLR_P24  (1 << 24)
#define PORTC_DIRCLR_P25  (1 << 25)
#define PORTC_DIRCLR_P26  (1 << 26)
#define PORTC_DIRCLR_P27  (1 << 27)
#define PORTC_DIRCLR_P28  (1 << 28)
#define PORTC_DIRCLR_P29  (1 << 29)
#define PORTC_DIRCLR_P30  (1 << 30)
#define PORTC_DIRCLR_P31  (1 << 31)

#define PORTC_DIRCLR_s    MMIO_REG(0x41004504, struct __struct_PORTC_DIRCLR)
struct __struct_PORTC_DIRCLR
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTC_DIRSET  MMIO_REG(0x41004508, uint32_t)
#define PORTC_DIRSET_P0 (1 << 0)
#define PORTC_DIRSET_P1 (1 << 1)
#define PORTC_DIRSET_P2 (1 << 2)
#define PORTC_DIRSET_P3 (1 << 3)
#define PORTC_DIRSET_P4 (1 << 4)
#define PORTC_DIRSET_P5 (1 << 5)
#define PORTC_DIRSET_P6 (1 << 6)
#define PORTC_DIRSET_P7 (1 << 7)
#define PORTC_DIRSET_P8 (1 << 8)
#define PORTC_DIRSET_P9 (1 << 9)
#define PORTC_DIRSET_P10  (1 << 10)
#define PORTC_DIRSET_P11  (1 << 11)
#define PORTC_DIRSET_P12  (1 << 12)
#define PORTC_DIRSET_P13  (1 << 13)
#define PORTC_DIRSET_P14  (1 << 14)
#define PORTC_DIRSET_P15  (1 << 15)
#define PORTC_DIRSET_P16  (1 << 16)
#define PORTC_DIRSET_P17  (1 << 17)
#define PORTC_DIRSET_P18  (1 << 18)
#define PORTC_DIRSET_P19  (1 << 19)
#define PORTC_DIRSET_P20  (1 << 20)
#define PORTC_DIRSET_P21  (1 << 21)
#define PORTC_DIRSET_P22  (1 << 22)
#define PORTC_DIRSET_P23  (1 << 23)
#define PORTC_DIRSET_P24  (1 << 24)
#define PORTC_DIRSET_P25  (1 << 25)
#define PORTC_DIRSET_P26  (1 << 26)
#define PORTC_DIRSET_P27  (1 << 27)
#define PORTC_DIRSET_P28  (1 << 28)
#define PORTC_DIRSET_P29  (1 << 29)
#define PORTC_DIRSET_P30  (1 << 30)
#define PORTC_DIRSET_P31  (1 << 31)

#define PORTC_DIRSET_s    MMIO_REG(0x41004508, struct __struct_PORTC_DIRSET)
struct __struct_PORTC_DIRSET
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTC_DIRTGL  MMIO_REG(0x4100450c, uint32_t)
#define PORTC_DIRTGL_P0 (1 << 0)
#define PORTC_DIRTGL_P1 (1 << 1)
#define PORTC_DIRTGL_P2 (1 << 2)
#define PORTC_DIRTGL_P3 (1 << 3)
#define PORTC_DIRTGL_P4 (1 << 4)
#define PORTC_DIRTGL_P5 (1 << 5)
#define PORTC_DIRTGL_P6 (1 << 6)
#define PORTC_DIRTGL_P7 (1 << 7)
#define PORTC_DIRTGL_P8 (1 << 8)
#define PORTC_DIRTGL_P9 (1 << 9)
#define PORTC_DIRTGL_P10  (1 << 10)
#define PORTC_DIRTGL_P11  (1 << 11)
#define PORTC_DIRTGL_P12  (1 << 12)
#define PORTC_DIRTGL_P13  (1 << 13)
#define PORTC_DIRTGL_P14  (1 << 14)
#define PORTC_DIRTGL_P15  (1 << 15)
#define PORTC_DIRTGL_P16  (1 << 16)
#define PORTC_DIRTGL_P17  (1 << 17)
#define PORTC_DIRTGL_P18  (1 << 18)
#define PORTC_DIRTGL_P19  (1 << 19)
#define PORTC_DIRTGL_P20  (1 << 20)
#define PORTC_DIRTGL_P21  (1 << 21)
#define PORTC_DIRTGL_P22  (1 << 22)
#define PORTC_DIRTGL_P23  (1 << 23)
#define PORTC_DIRTGL_P24  (1 << 24)
#define PORTC_DIRTGL_P25  (1 << 25)
#define PORTC_DIRTGL_P26  (1 << 26)
#define PORTC_DIRTGL_P27  (1 << 27)
#define PORTC_DIRTGL_P28  (1 << 28)
#define PORTC_DIRTGL_P29  (1 << 29)
#define PORTC_DIRTGL_P30  (1 << 30)
#define PORTC_DIRTGL_P31  (1 << 31)

