cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define PORTC_IN  MMIO_REG(0x41004520, uint32_t)
#define PORTC_IN_P0 (1 << 0)
#define PORTC_IN_P1 (1 << 1)
#define PORTC_IN_P2 (1 << 2)
#define PORTC_IN_P3 (1 << 3)
#define PORTC_IN_P4 (1 << 4)
#define PORTC_IN_P5 (1 << 5)
#define PORTC_IN_P6 (1 << 6)
#define PORTC_IN_P7 (1 << 7)
#define PORTC_IN_P8 (1 << 8)
#define PORTC_IN_P9 (1 << 9)
#define PORTC_IN_P10  (1 << 10)
#define PORTC_IN_P11  (1 << 11)
#define PORTC_IN_P12  (1 << 12)
#define PORTC_IN_P13  (1 << 13)
#define PORTC_IN_P14  (1 << 14)
#define PORTC_IN_P15  (1 << 15)
#define PORTC_IN_P16  (1 << 16)
#define PORTC_IN_P17  (1 << 17)
#define PORTC_IN_P18  (1 << 18)
#define PORTC_IN_P19  (1 << 19)
#define PORTC_IN_P20  (1 << 20)
#define PORTC_IN_P21  (1 << 21)
#define PORTC_IN_P22  (1 << 22)
#define PORTC_IN_P23  (1 << 23)
#define PORTC_IN_P24  (1 << 24)
#define PORTC_IN_P25  (1 << 25)
#define PORTC_IN_P26  (1 << 26)
#define PORTC_IN_P27  (1 << 27)
#define PORTC_IN_P28  (1 << 28)
#define PORTC_IN_P29  (1 << 29)
#define PORTC_IN_P30  (1 << 30)
#define PORTC_IN_P31  (1 << 31)

#define PORTC_IN_s    MMIO_REG(0x41004520, struct __struct_PORTC_IN)
struct __struct_PORTC_IN
{
  uint32_t p0 : 1;
  uint32_t p1 : 1;
  uint32_t p2 : 1;
  uint32_t p3 : 1;
  uint32_t p4 : 1;
  uint32_t p5 : 1;
  uint32_t p6 : 1;
  uint32_t p7 : 1;
  uint32_t p8 : 1;
  uint32_t p9 : 1;
  uint32_t p10 : 1;
  uint32_t p11 : 1;
  uint32_t p12 : 1;
  uint32_t p13 : 1;
  uint32_t p14 : 1;
  uint32_t p15 : 1;
  uint32_t p16 : 1;
  uint32_t p17 : 1;
  uint32_t p18 : 1;
  uint32_t p19 : 1;
  uint32_t p20 : 1;
  uint32_t p21 : 1;
  uint32_t p22 : 1;
  uint32_t p23 : 1;
  uint32_t p24 : 1;
  uint32_t p25 : 1;
  uint32_t p26 : 1;
  uint32_t p27 : 1;
  uint32_t p28 : 1;
  uint32_t p29 : 1;
  uint32_t p30 : 1;
  uint32_t p31 : 1;
};

#define PORTC_CTRL  MMIO_REG(0x41004524, uint32_t)

#define PORTC_WRCONFIG  MMIO_REG(0x41004528, uint32_t)
#define PORTC_WRCONFIG_PINMASK(x) ((x) << 0)
#define PORTC_WRCONFIG_PINMASK_MSK  0x0000ffff
#define PORTC_WRCONFIG_PINMASK_VAL(x) (((x) >> 0) & 0xffff)
#define PORTC_WRCONFIG_PMUXEN (1 << 16)
#define PORTC_WRCONFIG_INEN (1 << 17)
#define PORTC_WRCONFIG_PULLEN (1 << 18)
#define PORTC_WRCONFIG_PMUX(x)  ((x) << 24)
#define PORTC_WRCONFIG_PMUX_MSK 0x0f000000
#define PORTC_WRCONFIG_PMUX_VAL(x)  (((x) >> 24) & 0xf)
#define PORTC_WRCONFIG_WRPMUX (1 << 28)
#define PORTC_WRCONFIG_WRPINCFG (1 << 30)
#define PORTC_WRCONFIG_HWSEL  (1 << 31)

#define PORTC_WRCONFIG_s    MMIO_REG(0x41004528, struct __struct_PORTC_WRCONFIG)
struct __struct_PORTC_WRCONFIG
{
  uint32_t pinmask : 16;
  uint32_t pmuxen : 1;
  uint32_t inen : 1;
  uint32_t pullen : 1;
  uint32_t  : 5;
  uint32_t pmux : 4;
  uint32_t wrpmux : 1;
  uint32_t  : 1;
  uint32_t wrpincfg : 1;
  uint32_t hwsel : 1;
};

#define PORTC_PMUX0 MMIO_REG(0x41004530, uint8_t)
#define PORTC_PMUX0_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX0_PMUXE_MSK 0x0000000f
#define PORTC_PMUX0_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX0_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX0_PMUXO_MSK 0x000000f0
#define PORTC_PMUX0_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX0_s    MMIO_REG(0x41004530, struct __struct_PORTC_PMUX0)
struct __struct_PORTC_PMUX0
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX1 MMIO_REG(0x41004531, uint8_t)
#define PORTC_PMUX1_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX1_PMUXE_MSK 0x0000000f
#define PORTC_PMUX1_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX1_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX1_PMUXO_MSK 0x000000f0
#define PORTC_PMUX1_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX1_s    MMIO_REG(0x41004531, struct __struct_PORTC_PMUX1)
struct __struct_PORTC_PMUX1
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX2 MMIO_REG(0x41004532, uint8_t)
#define PORTC_PMUX2_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX2_PMUXE_MSK 0x0000000f
#define PORTC_PMUX2_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX2_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX2_PMUXO_MSK 0x000000f0
#define PORTC_PMUX2_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX2_s    MMIO_REG(0x41004532, struct __struct_PORTC_PMUX2)
struct __struct_PORTC_PMUX2
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX3 MMIO_REG(0x41004533, uint8_t)
#define PORTC_PMUX3_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX3_PMUXE_MSK 0x0000000f
#define PORTC_PMUX3_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX3_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX3_PMUXO_MSK 0x000000f0
#define PORTC_PMUX3_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX3_s    MMIO_REG(0x41004533, struct __struct_PORTC_PMUX3)
struct __struct_PORTC_PMUX3
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX4 MMIO_REG(0x41004534, uint8_t)
#define PORTC_PMUX4_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX4_PMUXE_MSK 0x0000000f
#define PORTC_PMUX4_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX4_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX4_PMUXO_MSK 0x000000f0
#define PORTC_PMUX4_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX4_s    MMIO_REG(0x41004534, struct __struct_PORTC_PMUX4)
struct __struct_PORTC_PMUX4
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX5 MMIO_REG(0x41004535, uint8_t)
#define PORTC_PMUX5_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX5_PMUXE_MSK 0x0000000f
#define PORTC_PMUX5_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX5_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX5_PMUXO_MSK 0x000000f0
#define PORTC_PMUX5_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX5_s    MMIO_REG(0x41004535, struct __struct_PORTC_PMUX5)
struct __struct_PORTC_PMUX5
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX6 MMIO_REG(0x41004536, uint8_t)
#define PORTC_PMUX6_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX6_PMUXE_MSK 0x0000000f
#define PORTC_PMUX6_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX6_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX6_PMUXO_MSK 0x000000f0
#define PORTC_PMUX6_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX6_s    MMIO_REG(0x41004536, struct __struct_PORTC_PMUX6)
struct __struct_PORTC_PMUX6
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX7 MMIO_REG(0x41004537, uint8_t)
#define PORTC_PMUX7_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX7_PMUXE_MSK 0x0000000f
#define PORTC_PMUX7_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX7_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX7_PMUXO_MSK 0x000000f0
#define PORTC_PMUX7_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

