cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define PORTC_PMUX7_s    MMIO_REG(0x41004537, struct __struct_PORTC_PMUX7)
struct __struct_PORTC_PMUX7
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX8 MMIO_REG(0x41004538, uint8_t)
#define PORTC_PMUX8_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX8_PMUXE_MSK 0x0000000f
#define PORTC_PMUX8_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX8_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX8_PMUXO_MSK 0x000000f0
#define PORTC_PMUX8_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX8_s    MMIO_REG(0x41004538, struct __struct_PORTC_PMUX8)
struct __struct_PORTC_PMUX8
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX9 MMIO_REG(0x41004539, uint8_t)
#define PORTC_PMUX9_PMUXE(x)  ((x) << 0)
#define PORTC_PMUX9_PMUXE_MSK 0x0000000f
#define PORTC_PMUX9_PMUXE_VAL(x)  (((x) >> 0) & 0xf)
#define PORTC_PMUX9_PMUXO(x)  ((x) << 4)
#define PORTC_PMUX9_PMUXO_MSK 0x000000f0
#define PORTC_PMUX9_PMUXO_VAL(x)  (((x) >> 4) & 0xf)

#define PORTC_PMUX9_s    MMIO_REG(0x41004539, struct __struct_PORTC_PMUX9)
struct __struct_PORTC_PMUX9
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX10  MMIO_REG(0x4100453a, uint8_t)
#define PORTC_PMUX10_PMUXE(x) ((x) << 0)
#define PORTC_PMUX10_PMUXE_MSK  0x0000000f
#define PORTC_PMUX10_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX10_PMUXO(x) ((x) << 4)
#define PORTC_PMUX10_PMUXO_MSK  0x000000f0
#define PORTC_PMUX10_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX10_s    MMIO_REG(0x4100453a, struct __struct_PORTC_PMUX10)
struct __struct_PORTC_PMUX10
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX11  MMIO_REG(0x4100453b, uint8_t)
#define PORTC_PMUX11_PMUXE(x) ((x) << 0)
#define PORTC_PMUX11_PMUXE_MSK  0x0000000f
#define PORTC_PMUX11_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX11_PMUXO(x) ((x) << 4)
#define PORTC_PMUX11_PMUXO_MSK  0x000000f0
#define PORTC_PMUX11_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX11_s    MMIO_REG(0x4100453b, struct __struct_PORTC_PMUX11)
struct __struct_PORTC_PMUX11
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX12  MMIO_REG(0x4100453c, uint8_t)
#define PORTC_PMUX12_PMUXE(x) ((x) << 0)
#define PORTC_PMUX12_PMUXE_MSK  0x0000000f
#define PORTC_PMUX12_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX12_PMUXO(x) ((x) << 4)
#define PORTC_PMUX12_PMUXO_MSK  0x000000f0
#define PORTC_PMUX12_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX12_s    MMIO_REG(0x4100453c, struct __struct_PORTC_PMUX12)
struct __struct_PORTC_PMUX12
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX13  MMIO_REG(0x4100453d, uint8_t)
#define PORTC_PMUX13_PMUXE(x) ((x) << 0)
#define PORTC_PMUX13_PMUXE_MSK  0x0000000f
#define PORTC_PMUX13_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX13_PMUXO(x) ((x) << 4)
#define PORTC_PMUX13_PMUXO_MSK  0x000000f0
#define PORTC_PMUX13_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX13_s    MMIO_REG(0x4100453d, struct __struct_PORTC_PMUX13)
struct __struct_PORTC_PMUX13
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX14  MMIO_REG(0x4100453e, uint8_t)
#define PORTC_PMUX14_PMUXE(x) ((x) << 0)
#define PORTC_PMUX14_PMUXE_MSK  0x0000000f
#define PORTC_PMUX14_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX14_PMUXO(x) ((x) << 4)
#define PORTC_PMUX14_PMUXO_MSK  0x000000f0
#define PORTC_PMUX14_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX14_s    MMIO_REG(0x4100453e, struct __struct_PORTC_PMUX14)
struct __struct_PORTC_PMUX14
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PMUX15  MMIO_REG(0x4100453f, uint8_t)
#define PORTC_PMUX15_PMUXE(x) ((x) << 0)
#define PORTC_PMUX15_PMUXE_MSK  0x0000000f
#define PORTC_PMUX15_PMUXE_VAL(x) (((x) >> 0) & 0xf)
#define PORTC_PMUX15_PMUXO(x) ((x) << 4)
#define PORTC_PMUX15_PMUXO_MSK  0x000000f0
#define PORTC_PMUX15_PMUXO_VAL(x) (((x) >> 4) & 0xf)

#define PORTC_PMUX15_s    MMIO_REG(0x4100453f, struct __struct_PORTC_PMUX15)
struct __struct_PORTC_PMUX15
{
  uint8_t pmuxe : 4;
  uint8_t pmuxo : 4;
};

#define PORTC_PINCFG0 MMIO_REG(0x41004540, uint8_t)
#define PORTC_PINCFG0_PMUXEN  (1 << 0)
#define PORTC_PINCFG0_INEN  (1 << 1)
#define PORTC_PINCFG0_PULLEN  (1 << 2)

#define PORTC_PINCFG0_s    MMIO_REG(0x41004540, struct __struct_PORTC_PINCFG0)
struct __struct_PORTC_PINCFG0
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG1 MMIO_REG(0x41004541, uint8_t)
#define PORTC_PINCFG1_PMUXEN  (1 << 0)
#define PORTC_PINCFG1_INEN  (1 << 1)
#define PORTC_PINCFG1_PULLEN  (1 << 2)

#define PORTC_PINCFG1_s    MMIO_REG(0x41004541, struct __struct_PORTC_PINCFG1)
struct __struct_PORTC_PINCFG1
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG2 MMIO_REG(0x41004542, uint8_t)
#define PORTC_PINCFG2_PMUXEN  (1 << 0)
#define PORTC_PINCFG2_INEN  (1 << 1)
#define PORTC_PINCFG2_PULLEN  (1 << 2)

#define PORTC_PINCFG2_s    MMIO_REG(0x41004542, struct __struct_PORTC_PINCFG2)
struct __struct_PORTC_PINCFG2
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG3 MMIO_REG(0x41004543, uint8_t)
#define PORTC_PINCFG3_PMUXEN  (1 << 0)
#define PORTC_PINCFG3_INEN  (1 << 1)
#define PORTC_PINCFG3_PULLEN  (1 << 2)

#define PORTC_PINCFG3_s    MMIO_REG(0x41004543, struct __struct_PORTC_PINCFG3)
struct __struct_PORTC_PINCFG3
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG4 MMIO_REG(0x41004544, uint8_t)
#define PORTC_PINCFG4_PMUXEN  (1 << 0)
#define PORTC_PINCFG4_INEN  (1 << 1)
#define PORTC_PINCFG4_PULLEN  (1 << 2)

#define PORTC_PINCFG4_s    MMIO_REG(0x41004544, struct __struct_PORTC_PINCFG4)
struct __struct_PORTC_PINCFG4
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG5 MMIO_REG(0x41004545, uint8_t)
#define PORTC_PINCFG5_PMUXEN  (1 << 0)
#define PORTC_PINCFG5_INEN  (1 << 1)
#define PORTC_PINCFG5_PULLEN  (1 << 2)

#define PORTC_PINCFG5_s    MMIO_REG(0x41004545, struct __struct_PORTC_PINCFG5)
struct __struct_PORTC_PINCFG5
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG6 MMIO_REG(0x41004546, uint8_t)
#define PORTC_PINCFG6_PMUXEN  (1 << 0)
#define PORTC_PINCFG6_INEN  (1 << 1)
#define PORTC_PINCFG6_PULLEN  (1 << 2)

#define PORTC_PINCFG6_s    MMIO_REG(0x41004546, struct __struct_PORTC_PINCFG6)
struct __struct_PORTC_PINCFG6
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG7 MMIO_REG(0x41004547, uint8_t)
#define PORTC_PINCFG7_PMUXEN  (1 << 0)
#define PORTC_PINCFG7_INEN  (1 << 1)
#define PORTC_PINCFG7_PULLEN  (1 << 2)

#define PORTC_PINCFG7_s    MMIO_REG(0x41004547, struct __struct_PORTC_PINCFG7)
struct __struct_PORTC_PINCFG7
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG8 MMIO_REG(0x41004548, uint8_t)
#define PORTC_PINCFG8_PMUXEN  (1 << 0)
#define PORTC_PINCFG8_INEN  (1 << 1)
#define PORTC_PINCFG8_PULLEN  (1 << 2)

#define PORTC_PINCFG8_s    MMIO_REG(0x41004548, struct __struct_PORTC_PINCFG8)
struct __struct_PORTC_PINCFG8
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG9 MMIO_REG(0x41004549, uint8_t)
#define PORTC_PINCFG9_PMUXEN  (1 << 0)
#define PORTC_PINCFG9_INEN  (1 << 1)
#define PORTC_PINCFG9_PULLEN  (1 << 2)

#define PORTC_PINCFG9_s    MMIO_REG(0x41004549, struct __struct_PORTC_PINCFG9)
struct __struct_PORTC_PINCFG9
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG10  MMIO_REG(0x4100454a, uint8_t)
#define PORTC_PINCFG10_PMUXEN (1 << 0)
#define PORTC_PINCFG10_INEN (1 << 1)
#define PORTC_PINCFG10_PULLEN (1 << 2)

