cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define PORTC_PINCFG10_s    MMIO_REG(0x4100454a, struct __struct_PORTC_PINCFG10)
struct __struct_PORTC_PINCFG10
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG11  MMIO_REG(0x4100454b, uint8_t)
#define PORTC_PINCFG11_PMUXEN (1 << 0)
#define PORTC_PINCFG11_INEN (1 << 1)
#define PORTC_PINCFG11_PULLEN (1 << 2)

#define PORTC_PINCFG11_s    MMIO_REG(0x4100454b, struct __struct_PORTC_PINCFG11)
struct __struct_PORTC_PINCFG11
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG12  MMIO_REG(0x4100454c, uint8_t)
#define PORTC_PINCFG12_PMUXEN (1 << 0)
#define PORTC_PINCFG12_INEN (1 << 1)
#define PORTC_PINCFG12_PULLEN (1 << 2)

#define PORTC_PINCFG12_s    MMIO_REG(0x4100454c, struct __struct_PORTC_PINCFG12)
struct __struct_PORTC_PINCFG12
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG13  MMIO_REG(0x4100454d, uint8_t)
#define PORTC_PINCFG13_PMUXEN (1 << 0)
#define PORTC_PINCFG13_INEN (1 << 1)
#define PORTC_PINCFG13_PULLEN (1 << 2)

#define PORTC_PINCFG13_s    MMIO_REG(0x4100454d, struct __struct_PORTC_PINCFG13)
struct __struct_PORTC_PINCFG13
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG14  MMIO_REG(0x4100454e, uint8_t)
#define PORTC_PINCFG14_PMUXEN (1 << 0)
#define PORTC_PINCFG14_INEN (1 << 1)
#define PORTC_PINCFG14_PULLEN (1 << 2)

#define PORTC_PINCFG14_s    MMIO_REG(0x4100454e, struct __struct_PORTC_PINCFG14)
struct __struct_PORTC_PINCFG14
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG15  MMIO_REG(0x4100454f, uint8_t)
#define PORTC_PINCFG15_PMUXEN (1 << 0)
#define PORTC_PINCFG15_INEN (1 << 1)
#define PORTC_PINCFG15_PULLEN (1 << 2)

#define PORTC_PINCFG15_s    MMIO_REG(0x4100454f, struct __struct_PORTC_PINCFG15)
struct __struct_PORTC_PINCFG15
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG16  MMIO_REG(0x41004550, uint8_t)
#define PORTC_PINCFG16_PMUXEN (1 << 0)
#define PORTC_PINCFG16_INEN (1 << 1)
#define PORTC_PINCFG16_PULLEN (1 << 2)

#define PORTC_PINCFG16_s    MMIO_REG(0x41004550, struct __struct_PORTC_PINCFG16)
struct __struct_PORTC_PINCFG16
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG17  MMIO_REG(0x41004551, uint8_t)
#define PORTC_PINCFG17_PMUXEN (1 << 0)
#define PORTC_PINCFG17_INEN (1 << 1)
#define PORTC_PINCFG17_PULLEN (1 << 2)

#define PORTC_PINCFG17_s    MMIO_REG(0x41004551, struct __struct_PORTC_PINCFG17)
struct __struct_PORTC_PINCFG17
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG18  MMIO_REG(0x41004552, uint8_t)
#define PORTC_PINCFG18_PMUXEN (1 << 0)
#define PORTC_PINCFG18_INEN (1 << 1)
#define PORTC_PINCFG18_PULLEN (1 << 2)

#define PORTC_PINCFG18_s    MMIO_REG(0x41004552, struct __struct_PORTC_PINCFG18)
struct __struct_PORTC_PINCFG18
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG19  MMIO_REG(0x41004553, uint8_t)
#define PORTC_PINCFG19_PMUXEN (1 << 0)
#define PORTC_PINCFG19_INEN (1 << 1)
#define PORTC_PINCFG19_PULLEN (1 << 2)

#define PORTC_PINCFG19_s    MMIO_REG(0x41004553, struct __struct_PORTC_PINCFG19)
struct __struct_PORTC_PINCFG19
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG20  MMIO_REG(0x41004554, uint8_t)
#define PORTC_PINCFG20_PMUXEN (1 << 0)
#define PORTC_PINCFG20_INEN (1 << 1)
#define PORTC_PINCFG20_PULLEN (1 << 2)

#define PORTC_PINCFG20_s    MMIO_REG(0x41004554, struct __struct_PORTC_PINCFG20)
struct __struct_PORTC_PINCFG20
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG21  MMIO_REG(0x41004555, uint8_t)
#define PORTC_PINCFG21_PMUXEN (1 << 0)
#define PORTC_PINCFG21_INEN (1 << 1)
#define PORTC_PINCFG21_PULLEN (1 << 2)

#define PORTC_PINCFG21_s    MMIO_REG(0x41004555, struct __struct_PORTC_PINCFG21)
struct __struct_PORTC_PINCFG21
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG22  MMIO_REG(0x41004556, uint8_t)
#define PORTC_PINCFG22_PMUXEN (1 << 0)
#define PORTC_PINCFG22_INEN (1 << 1)
#define PORTC_PINCFG22_PULLEN (1 << 2)

#define PORTC_PINCFG22_s    MMIO_REG(0x41004556, struct __struct_PORTC_PINCFG22)
struct __struct_PORTC_PINCFG22
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG23  MMIO_REG(0x41004557, uint8_t)
#define PORTC_PINCFG23_PMUXEN (1 << 0)
#define PORTC_PINCFG23_INEN (1 << 1)
#define PORTC_PINCFG23_PULLEN (1 << 2)

#define PORTC_PINCFG23_s    MMIO_REG(0x41004557, struct __struct_PORTC_PINCFG23)
struct __struct_PORTC_PINCFG23
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG24  MMIO_REG(0x41004558, uint8_t)
#define PORTC_PINCFG24_PMUXEN (1 << 0)
#define PORTC_PINCFG24_INEN (1 << 1)
#define PORTC_PINCFG24_PULLEN (1 << 2)

#define PORTC_PINCFG24_s    MMIO_REG(0x41004558, struct __struct_PORTC_PINCFG24)
struct __struct_PORTC_PINCFG24
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG25  MMIO_REG(0x41004559, uint8_t)
#define PORTC_PINCFG25_PMUXEN (1 << 0)
#define PORTC_PINCFG25_INEN (1 << 1)
#define PORTC_PINCFG25_PULLEN (1 << 2)

#define PORTC_PINCFG25_s    MMIO_REG(0x41004559, struct __struct_PORTC_PINCFG25)
struct __struct_PORTC_PINCFG25
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG26  MMIO_REG(0x4100455a, uint8_t)
#define PORTC_PINCFG26_PMUXEN (1 << 0)
#define PORTC_PINCFG26_INEN (1 << 1)
#define PORTC_PINCFG26_PULLEN (1 << 2)

#define PORTC_PINCFG26_s    MMIO_REG(0x4100455a, struct __struct_PORTC_PINCFG26)
struct __struct_PORTC_PINCFG26
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG27  MMIO_REG(0x4100455b, uint8_t)
#define PORTC_PINCFG27_PMUXEN (1 << 0)
#define PORTC_PINCFG27_INEN (1 << 1)
#define PORTC_PINCFG27_PULLEN (1 << 2)

#define PORTC_PINCFG27_s    MMIO_REG(0x4100455b, struct __struct_PORTC_PINCFG27)
struct __struct_PORTC_PINCFG27
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

