cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define PORTC_PINCFG28  MMIO_REG(0x4100455c, uint8_t)
#define PORTC_PINCFG28_PMUXEN (1 << 0)
#define PORTC_PINCFG28_INEN (1 << 1)
#define PORTC_PINCFG28_PULLEN (1 << 2)

#define PORTC_PINCFG28_s    MMIO_REG(0x4100455c, struct __struct_PORTC_PINCFG28)
struct __struct_PORTC_PINCFG28
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG29  MMIO_REG(0x4100455d, uint8_t)
#define PORTC_PINCFG29_PMUXEN (1 << 0)
#define PORTC_PINCFG29_INEN (1 << 1)
#define PORTC_PINCFG29_PULLEN (1 << 2)

#define PORTC_PINCFG29_s    MMIO_REG(0x4100455d, struct __struct_PORTC_PINCFG29)
struct __struct_PORTC_PINCFG29
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG30  MMIO_REG(0x4100455e, uint8_t)
#define PORTC_PINCFG30_PMUXEN (1 << 0)
#define PORTC_PINCFG30_INEN (1 << 1)
#define PORTC_PINCFG30_PULLEN (1 << 2)

#define PORTC_PINCFG30_s    MMIO_REG(0x4100455e, struct __struct_PORTC_PINCFG30)
struct __struct_PORTC_PINCFG30
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

#define PORTC_PINCFG31  MMIO_REG(0x4100455f, uint8_t)
#define PORTC_PINCFG31_PMUXEN (1 << 0)
#define PORTC_PINCFG31_INEN (1 << 1)
#define PORTC_PINCFG31_PULLEN (1 << 2)

#define PORTC_PINCFG31_s    MMIO_REG(0x4100455f, struct __struct_PORTC_PINCFG31)
struct __struct_PORTC_PINCFG31
{
  uint8_t pmuxen : 1;
  uint8_t inen : 1;
  uint8_t pullen : 1;
  uint8_t  : 5;
};

// 0x42000000 PAC2

#define PAC2_WPCLR	MMIO_REG(0x42000000, uint32_t)
#define PAC2_WPCLR_EVSYS	(1 << 1)
#define PAC2_WPCLR_SERCOM0	(1 << 2)
#define PAC2_WPCLR_SERCOM1	(1 << 3)
#define PAC2_WPCLR_SERCOM2	(1 << 4)
#define PAC2_WPCLR_SERCOM3	(1 << 5)
#define PAC2_WPCLR_SERCOM4	(1 << 6)
#define PAC2_WPCLR_SERCOM5	(1 << 7)
#define PAC2_WPCLR_TCC0	(1 << 8)
#define PAC2_WPCLR_TCC1	(1 << 9)
#define PAC2_WPCLR_TC2	(1 << 10)
#define PAC2_WPCLR_TC3	(1 << 11)
#define PAC2_WPCLR_TC4	(1 << 12)
#define PAC2_WPCLR_TC5	(1 << 13)
#define PAC2_WPCLR_TC6	(1 << 14)
#define PAC2_WPCLR_TC7	(1 << 15)
#define PAC2_WPCLR_ADC	(1 << 16)
#define PAC2_WPCLR_AC	(1 << 17)
#define PAC2_WPCLR_DAC	(1 << 18)
#define PAC2_WPCLR_PTC	(1 << 19)

#define PAC2_WPCLR_s    MMIO_REG(0x42000000, struct __struct_PAC2_WPCLR)
struct __struct_PAC2_WPCLR
{
  uint32_t  : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t tcc0 : 1;
  uint32_t tcc1 : 1;
  uint32_t tcc2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t i2s : 1;
  uint32_t  : 11;
};

#define PAC2_WPSET	MMIO_REG(0x42000004, uint32_t)
#define PAC2_WPSET_EVSYS	(1 << 1)
#define PAC2_WPSET_SERCOM0	(1 << 2)
#define PAC2_WPSET_SERCOM1	(1 << 3)
#define PAC2_WPSET_SERCOM2	(1 << 4)
#define PAC2_WPSET_SERCOM3	(1 << 5)
#define PAC2_WPSET_SERCOM4	(1 << 6)
#define PAC2_WPSET_SERCOM5	(1 << 7)
#define PAC2_WPSET_TCC0	(1 << 8)
#define PAC2_WPSET_TCC1	(1 << 9)
#define PAC2_WPSET_TC2	(1 << 10)
#define PAC2_WPSET_TC3	(1 << 11)
#define PAC2_WPSET_TC4	(1 << 12)
#define PAC2_WPSET_TC5	(1 << 13)
#define PAC2_WPSET_TC6	(1 << 14)
#define PAC2_WPSET_TC7	(1 << 15)
#define PAC2_WPSET_ADC	(1 << 16)
#define PAC2_WPSET_AC	(1 << 17)
#define PAC2_WPSET_DAC	(1 << 18)
#define PAC2_WPSET_PTC	(1 << 19)

#define PAC2_WPSET_s    MMIO_REG(0x42000004, struct __struct_PAC2_WPSET)
struct __struct_PAC2_WPSET
{
  uint32_t  : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t TCC0 : 1;
  uint32_t TCC1 : 1;
  uint32_t TCC2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t i2s : 1;
  uint32_t  : 11;
};

// 0x42000400 EVSYS

#define EVSYS_CTRL	MMIO_REG(0x42000400, uint8_t)
#define EVSYS_CTRL_SWRST	(1 << 0)
#define EVSYS_CTRL_GCLKREQ	(1 << 4)

#define EVSYS_CTRL_s    MMIO_REG(0x42000400, struct __struct_EVSYS_CTRL)
struct __struct_EVSYS_CTRL
{
  uint8_t swrst : 1;
  uint8_t  : 3;
  uint8_t gclkreq : 1;
  uint8_t  : 3;
};

#define EVSYS_CHANNEL	MMIO_REG(0x42000404, uint32_t)
#define EVSYS_CHANNEL_CHANNEL(x)	((x) << 0)
#define EVSYS_CHANNEL_CHANNEL_MSK	0x000000ff
#define EVSYS_CHANNEL_CHANNEL_VAL(x)	(((x) >> 0) & 0xff)
#define EVSYS_CHANNEL_SWEVT	(1 << 8)
#define EVSYS_CHANNEL_EVGEN(x)	((x) << 16)
#define EVSYS_CHANNEL_EVGEN_MSK	0x00ff0000
#define EVSYS_CHANNEL_EVGEN_VAL(x)	(((x) >> 16) & 0xff)
#define EVSYS_CHANNEL_PATH(x)	((x) << 24)
#define EVSYS_CHANNEL_PATH_MSK	0x03000000
#define EVSYS_CHANNEL_PATH_VAL(x)	(((x) >> 24) & 0x3)
#define EVSYS_CHANNEL_EDGSEL(x)	((x) << 26)
#define EVSYS_CHANNEL_EDGSEL_MSK	0x0c000000
#define EVSYS_CHANNEL_EDGSEL_VAL(x)	(((x) >> 26) & 0x3)

#define EVSYS_CHANNEL_s    MMIO_REG(0x42000404, struct __struct_EVSYS_CHANNEL)
struct __struct_EVSYS_CHANNEL
{
  uint32_t channel : 4;
  uint32_t : 4;
  uint32_t swevt : 1;
  uint32_t  : 7;
  uint32_t evgen : 7;
  uint32_t path : 2;
  uint32_t edgsel : 2;
  uint32_t  : 4;
};

#define EVSYS_USER	MMIO_REG(0x42000408, uint16_t)
#define EVSYS_USER_USER(x)	((x) << 0)
#define EVSYS_USER_USER_MSK	0x000000ff
#define EVSYS_USER_USER_VAL(x)	(((x) >> 0) & 0xff)
#define EVSYS_USER_CHANNEL(x)	((x) << 8)
#define EVSYS_USER_CHANNEL_MSK	0x0000ff00
#define EVSYS_USER_CHANNEL_VAL(x)	(((x) >> 8) & 0xff)

#define EVSYS_USER_s    MMIO_REG(0x42000408, struct __struct_EVSYS_USER)
struct __struct_EVSYS_USER
{
  uint16_t user : 5;
  uint16_t : 3;
  uint16_t channel : 5;
  uint16_t : 3;
};

#define EVSYS_CHSTATUS	MMIO_REG(0x4200040c, uint32_t)
#define EVSYS_CHSTATUS_USRRDY0	(1 << 0)
#define EVSYS_CHSTATUS_USRRDY1	(1 << 1)
#define EVSYS_CHSTATUS_USRRDY2	(1 << 2)
#define EVSYS_CHSTATUS_USRRDY3	(1 << 3)
#define EVSYS_CHSTATUS_USRRDY4	(1 << 4)
#define EVSYS_CHSTATUS_USRRDY5	(1 << 5)
#define EVSYS_CHSTATUS_USRRDY6	(1 << 6)
#define EVSYS_CHSTATUS_USRRDY7	(1 << 7)
#define EVSYS_CHSTATUS_CHBUSY0	(1 << 8)
#define EVSYS_CHSTATUS_CHBUSY1	(1 << 9)
#define EVSYS_CHSTATUS_CHBUSY2	(1 << 10)
#define EVSYS_CHSTATUS_CHBUSY3	(1 << 11)
#define EVSYS_CHSTATUS_CHBUSY4	(1 << 12)
#define EVSYS_CHSTATUS_CHBUSY5	(1 << 13)
#define EVSYS_CHSTATUS_CHBUSY6	(1 << 14)
#define EVSYS_CHSTATUS_CHBUSY7	(1 << 15)

#define EVSYS_CHSTATUS_s    MMIO_REG(0x4200040c, struct __struct_EVSYS_CHSTATUS)
struct __struct_EVSYS_CHSTATUS
{
  uint32_t usrrdy0 : 1;
  uint32_t usrrdy1 : 1;
  uint32_t usrrdy2 : 1;
  uint32_t usrrdy3 : 1;
  uint32_t usrrdy4 : 1;
  uint32_t usrrdy5 : 1;
  uint32_t usrrdy6 : 1;
  uint32_t usrrdy7 : 1;
  uint32_t chbusy0 : 1;
  uint32_t chbusy1 : 1;
  uint32_t chbusy2 : 1;
  uint32_t chbusy3 : 1;
  uint32_t chbusy4 : 1;
  uint32_t chbusy5 : 1;
  uint32_t chbusy6 : 1;
  uint32_t chbusy7 : 1;
  uint32_t usrrdy8 : 1;
  uint32_t usrrdy9 : 1;
  uint32_t usrrdy10 : 1;
  uint32_t usrrdy11 : 1;
  uint32_t  : 4;
  uint32_t chbusy8 : 1;
  uint32_t chbusy9 : 1;
  uint32_t chbusy10 : 1;
  uint32_t chbusy11 : 1;
  uint32_t  : 4;
};

#define EVSYS_INTENCLR	MMIO_REG(0x42000410, uint32_t)
#define EVSYS_INTENCLR_OVR0	(1 << 0)
#define EVSYS_INTENCLR_OVR1	(1 << 1)
#define EVSYS_INTENCLR_OVR2	(1 << 2)
#define EVSYS_INTENCLR_OVR3	(1 << 3)
#define EVSYS_INTENCLR_OVR4	(1 << 4)
#define EVSYS_INTENCLR_OVR5	(1 << 5)
#define EVSYS_INTENCLR_OVR6	(1 << 6)
#define EVSYS_INTENCLR_OVR7	(1 << 7)
#define EVSYS_INTENCLR_EVD0	(1 << 8)
#define EVSYS_INTENCLR_EVD1	(1 << 9)
#define EVSYS_INTENCLR_EVD2	(1 << 10)
#define EVSYS_INTENCLR_EVD3	(1 << 11)
#define EVSYS_INTENCLR_EVD4	(1 << 12)
#define EVSYS_INTENCLR_EVD5	(1 << 13)
#define EVSYS_INTENCLR_EVD6	(1 << 14)
#define EVSYS_INTENCLR_EVD7	(1 << 15)

