cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define EVSYS_INTENCLR_s    MMIO_REG(0x42000410, struct __struct_EVSYS_INTENCLR)
struct __struct_EVSYS_INTENCLR
{
  uint32_t ovr0 : 1;
  uint32_t ovr1 : 1;
  uint32_t ovr2 : 1;
  uint32_t ovr3 : 1;
  uint32_t ovr4 : 1;
  uint32_t ovr5 : 1;
  uint32_t ovr6 : 1;
  uint32_t ovr7 : 1;
  uint32_t evd0 : 1;
  uint32_t evd1 : 1;
  uint32_t evd2 : 1;
  uint32_t evd3 : 1;
  uint32_t evd4 : 1;
  uint32_t evd5 : 1;
  uint32_t evd6 : 1;
  uint32_t evd7 : 1;
  uint32_t ovr8 : 1;
  uint32_t ovr9 : 1;
  uint32_t ovr10 : 1;
  uint32_t ovr11 : 1;
  uint32_t  : 4;
  uint32_t evd8 : 1;
  uint32_t evd9 : 1;
  uint32_t evd10 : 1;
  uint32_t evd11 : 1;
  uint32_t  : 4;
};

#define EVSYS_INTENSET	MMIO_REG(0x42000414, uint32_t)
#define EVSYS_INTENSET_OVR0	(1 << 0)
#define EVSYS_INTENSET_OVR1	(1 << 1)
#define EVSYS_INTENSET_OVR2	(1 << 2)
#define EVSYS_INTENSET_OVR3	(1 << 3)
#define EVSYS_INTENSET_OVR4	(1 << 4)
#define EVSYS_INTENSET_OVR5	(1 << 5)
#define EVSYS_INTENSET_OVR6	(1 << 6)
#define EVSYS_INTENSET_OVR7	(1 << 7)
#define EVSYS_INTENSET_EVD0	(1 << 8)
#define EVSYS_INTENSET_EVD1	(1 << 9)
#define EVSYS_INTENSET_EVD2	(1 << 10)
#define EVSYS_INTENSET_EVD3	(1 << 11)
#define EVSYS_INTENSET_EVD4	(1 << 12)
#define EVSYS_INTENSET_EVD5	(1 << 13)
#define EVSYS_INTENSET_EVD6	(1 << 14)
#define EVSYS_INTENSET_EVD7	(1 << 15)

#define EVSYS_INTENSET_s    MMIO_REG(0x42000414, struct __struct_EVSYS_INTENSET)
struct __struct_EVSYS_INTENSET
{
  uint32_t ovr0 : 1;
  uint32_t ovr1 : 1;
  uint32_t ovr2 : 1;
  uint32_t ovr3 : 1;
  uint32_t ovr4 : 1;
  uint32_t ovr5 : 1;
  uint32_t ovr6 : 1;
  uint32_t ovr7 : 1;
  uint32_t evd0 : 1;
  uint32_t evd1 : 1;
  uint32_t evd2 : 1;
  uint32_t evd3 : 1;
  uint32_t evd4 : 1;
  uint32_t evd5 : 1;
  uint32_t evd6 : 1;
  uint32_t evd7 : 1;
  uint32_t ovr8 : 1;
  uint32_t ovr9 : 1;
  uint32_t ovr10 : 1;
  uint32_t ovr11 : 1;
  uint32_t  : 4;
  uint32_t evd8 : 1;
  uint32_t evd9 : 1;
  uint32_t evd10 : 1;
  uint32_t evd11 : 1;
  uint32_t  : 4;
};

#define EVSYS_INTFLAG	MMIO_REG(0x42000418, uint32_t)
#define EVSYS_INTFLAG_OVR0	(1 << 0)
#define EVSYS_INTFLAG_OVR1	(1 << 1)
#define EVSYS_INTFLAG_OVR2	(1 << 2)
#define EVSYS_INTFLAG_OVR3	(1 << 3)
#define EVSYS_INTFLAG_OVR4	(1 << 4)
#define EVSYS_INTFLAG_OVR5	(1 << 5)
#define EVSYS_INTFLAG_OVR6	(1 << 6)
#define EVSYS_INTFLAG_OVR7	(1 << 7)
#define EVSYS_INTFLAG_EVD0	(1 << 8)
#define EVSYS_INTFLAG_EVD1	(1 << 9)
#define EVSYS_INTFLAG_EVD2	(1 << 10)
#define EVSYS_INTFLAG_EVD3	(1 << 11)
#define EVSYS_INTFLAG_EVD4	(1 << 12)
#define EVSYS_INTFLAG_EVD5	(1 << 13)
#define EVSYS_INTFLAG_EVD6	(1 << 14)
#define EVSYS_INTFLAG_EVD7	(1 << 15)

#define EVSYS_INTFLAG_s    MMIO_REG(0x42000418, struct __struct_EVSYS_INTFLAG)
struct __struct_EVSYS_INTFLAG
{
  uint32_t ovr0 : 1;
  uint32_t ovr1 : 1;
  uint32_t ovr2 : 1;
  uint32_t ovr3 : 1;
  uint32_t ovr4 : 1;
  uint32_t ovr5 : 1;
  uint32_t ovr6 : 1;
  uint32_t ovr7 : 1;
  uint32_t evd0 : 1;
  uint32_t evd1 : 1;
  uint32_t evd2 : 1;
  uint32_t evd3 : 1;
  uint32_t evd4 : 1;
  uint32_t evd5 : 1;
  uint32_t evd6 : 1;
  uint32_t evd7 : 1;
  uint32_t ovr8 : 1;
  uint32_t ovr9 : 1;
  uint32_t ovr10 : 1;
  uint32_t ovr11 : 1;
  uint32_t  : 4;
  uint32_t evd8 : 1;
  uint32_t evd9 : 1;
  uint32_t evd10 : 1;
  uint32_t evd11 : 1;
  uint32_t  : 4;
};

// 0x42000800 SC0_USART

#define SC0_USART_CTRLA	MMIO_REG(0x42000800, uint32_t)
#define SC0_USART_CTRLA_SWRST	(1 << 0)
#define SC0_USART_CTRLA_ENABLE	(1 << 1)
#define SC0_USART_CTRLA_MODE(x)	((x) << 2)
#define SC0_USART_CTRLA_MODE_MSK	0x0000001c
#define SC0_USART_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC0_USART_CTRLA_RUNSTDBY	(1 << 7)
#define SC0_USART_CTRLA_TXPO	(1 << 16)
#define SC0_USART_CTRLA_RXPO(x)	((x) << 20)
#define SC0_USART_CTRLA_RXPO_MSK	0x00300000
#define SC0_USART_CTRLA_RXPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC0_USART_CTRLA_FORM(x)	((x) << 24)
#define SC0_USART_CTRLA_FORM_MSK	0x0f000000
#define SC0_USART_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC0_USART_CTRLA_CMODE	(1 << 28)
#define SC0_USART_CTRLA_CPOL	(1 << 29)
#define SC0_USART_CTRLA_DORD	(1 << 30)

#define SC0_USART_CTRLA_s    MMIO_REG(0x42000800, struct __struct_SC0_USART_CTRLA)
struct __struct_SC0_USART_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t ibon : 1;
  uint32_t  : 4;
  uint32_t sampr : 3;
  uint32_t txpo : 2;
  uint32_t  : 2;
  uint32_t rxpo : 2;
  uint32_t sampa : 2;
  uint32_t form : 4;
  uint32_t cmode : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC0_USART_CTRLB	MMIO_REG(0x42000804, uint32_t)
#define SC0_USART_CTRLB_CHSIZE(x)	((x) << 0)
#define SC0_USART_CTRLB_CHSIZE_MSK	0x00000007
#define SC0_USART_CTRLB_CHSIZE_VAL(x)	(((x) >> 0) & 0x7)
#define SC0_USART_CTRLB_SBMODE	(1 << 6)
#define SC0_USART_CTRLB_PMODE	(1 << 13)
#define SC0_USART_CTRLB_TXEN	(1 << 16)
#define SC0_USART_CTRLB_RXEN	(1 << 17)

#define SC0_USART_CTRLB_s    MMIO_REG(0x42000804, struct __struct_SC0_USART_CTRLB)
struct __struct_SC0_USART_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t sbmode : 1;
  uint32_t  : 1;
  uint32_t colden : 1;
  uint32_t sfde : 1;
  uint32_t enc : 1;
  uint32_t  : 2;
  uint32_t pmode : 1;
  uint32_t  : 2;
  uint32_t txen : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC0_USART_DBGCTRL	MMIO_REG(0x42000830, uint8_t)
#define SC0_USART_DBGCTRL_DBGSTOP	(1 << 0)

#define SC0_USART_DBGCTRL_s    MMIO_REG(0x42000830, struct __struct_SC0_USART_DBGCTRL)
struct __struct_SC0_USART_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC0_USART_BAUD	MMIO_REG(0x4200080c, uint16_t)
#define SC0_USART_BAUD_BAUD(x)	((x) << 0)
#define SC0_USART_BAUD_BAUD_MSK	0x0000ffff
#define SC0_USART_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xffff)

#define SC0_USART_BAUD_s    MMIO_REG(0x4200080c, struct __struct_SC0_USART_BAUD)
struct __struct_SC0_USART_BAUD
{
  uint16_t baud : 16;
};

#define SC0_USART_INTENCLR	MMIO_REG(0x42000814, uint8_t)
#define SC0_USART_INTENCLR_DRE	(1 << 0)
#define SC0_USART_INTENCLR_TXC	(1 << 1)
#define SC0_USART_INTENCLR_RXC	(1 << 2)

#define SC0_USART_INTENCLR_s    MMIO_REG(0x42000814, struct __struct_SC0_USART_INTENCLR)
struct __struct_SC0_USART_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t rxs : 1;
  uint8_t ctsic : 1;
  uint8_t rxbrk : 1;
  uint8_t  : 1;
  uint8_t error : 1;
};

#define SC0_USART_INTENSET	MMIO_REG(0x42000816, uint8_t)
#define SC0_USART_INTENSET_DRE	(1 << 0)
#define SC0_USART_INTENSET_TXC	(1 << 1)
#define SC0_USART_INTENSET_RXC	(1 << 2)

#define SC0_USART_INTENSET_s    MMIO_REG(0x42000816, struct __struct_SC0_USART_INTENSET)
struct __struct_SC0_USART_INTENSET
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t rxs : 1;
  uint8_t ctsic : 1;
  uint8_t rxbrk : 1;
  uint8_t  : 1;
  uint8_t error : 1;
};

#define SC0_USART_INTFLAG	MMIO_REG(0x42000818, uint8_t)
#define SC0_USART_INTFLAG_DRE	(1 << 0)
#define SC0_USART_INTFLAG_TXC	(1 << 1)
#define SC0_USART_INTFLAG_RXC	(1 << 2)

#define SC0_USART_INTFLAG_s    MMIO_REG(0x42000818, struct __struct_SC0_USART_INTFLAG)
struct __struct_SC0_USART_INTFLAG
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t rxs : 1;
  uint8_t ctsic : 1;
  uint8_t rxbrk : 1;
  uint8_t  : 1;
  uint8_t error : 1;
};

