cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define SC0_USART_STATUS	MMIO_REG(0x4200081a, uint16_t)
#define SC0_USART_STATUS_PERR	(1 << 0)
#define SC0_USART_STATUS_FERR	(1 << 1)
#define SC0_USART_STATUS_BUFOVF	(1 << 2)
#define SC0_USART_STATUS_SYNCBUSY	(1 << 15)

#define SC0_USART_STATUS_s    MMIO_REG(0x4200081a, struct __struct_SC0_USART_STATUS)
struct __struct_SC0_USART_STATUS
{
  uint16_t perr : 1;
  uint16_t ferr : 1;
  uint16_t bufovf : 1;
  uint16_t cts : 1;
  uint16_t isf : 1;
  uint16_t coll : 1;
  uint16_t  : 10;
};

#define SC0_USART_SYNCBUSY_s    MMIO_REG(0x4200081c, struct __struct_SC0_USART_SYNCBUSY)
struct __struct_SC0_USART_SYNCBUSY
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t ctrlb : 1;
  uint32_t  : 29;
};


#define SC0_USART_DATA	MMIO_REG(0x42000828, uint16_t)
#define SC0_USART_DATA_DATA(x)	((x) << 0)
#define SC0_USART_DATA_DATA_MSK	0x000001ff
#define SC0_USART_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

#define SC0_USART_DATA_s    MMIO_REG(0x42000828, struct __struct_SC0_USART_DATA)
struct __struct_SC0_USART_DATA
{
  uint16_t data : 9;
  uint16_t  : 7;
};

// 0x42000800 SC0_SPI

#define SC0_SPI_CTRLA	MMIO_REG(0x42000800, uint32_t)
#define SC0_SPI_CTRLA_SWRST	(1 << 0)
#define SC0_SPI_CTRLA_ENABLE	(1 << 1)
#define SC0_SPI_CTRLA_MODE(x)	((x) << 2)
#define SC0_SPI_CTRLA_MODE_MSK	0x0000001c
#define SC0_SPI_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC0_SPI_CTRLA_RUNSTDBY	(1 << 7)
#define SC0_SPI_CTRLA_DOPO(x) ((x) << 16)
#define SC0_SPI_CTRLA_DOPO_MSK  0x00030000
#define SC0_SPI_CTRLA_DOPO_VAL(x) (((x) >> 16) & 0x3)
#define SC0_SPI_CTRLA_DIPO(x)	((x) << 20)
#define SC0_SPI_CTRLA_DIPO_MSK	0x00300000
#define SC0_SPI_CTRLA_DIPO_VAL(x)	(((x) >> 20) & 0x3)
#define SC0_SPI_CTRLA_FORM(x)	((x) << 24)
#define SC0_SPI_CTRLA_FORM_MSK	0x0f000000
#define SC0_SPI_CTRLA_FORM_VAL(x)	(((x) >> 24) & 0xf)
#define SC0_SPI_CTRLA_CPHA	(1 << 28)
#define SC0_SPI_CTRLA_CPOL	(1 << 29)
#define SC0_SPI_CTRLA_DORD	(1 << 30)

#define SC0_SPI_CTRLA_s    MMIO_REG(0x42000800, struct __struct_SC0_SPI_CTRLA)
struct __struct_SC0_SPI_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t ibon : 1;
  uint32_t  : 7;
  uint32_t dopo : 2;
  uint32_t  : 2;
  uint32_t dipo : 2;
  uint32_t  : 2;
  uint32_t form : 4;
  uint32_t cpha : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC0_SPI_CTRLB	MMIO_REG(0x42000804, uint32_t)
#define SC0_SPI_CTRLB_CHSIZE(x)	((x) << 0)
#define SC0_SPI_CTRLB_CHSIZE_MSK	0x00000007
#define SC0_SPI_CTRLB_CHSIZE_VAL(x)	(((x) >> 0) & 0x7)
#define SC0_SPI_CTRLB_PLOADEN	(1 << 6)
#define SC0_SPI_CTRLB_AMODE(x)	((x) << 14)
#define SC0_SPI_CTRLB_AMODE_MSK	0x0000c000
#define SC0_SPI_CTRLB_AMODE_VAL(x)	(((x) >> 14) & 0x3)
#define SC0_SPI_CTRLB_RXEN	(1 << 17)

#define SC0_SPI_CTRLB_s    MMIO_REG(0x42000804, struct __struct_SC0_SPI_CTRLB)
struct __struct_SC0_SPI_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t ploaden : 1;
  uint32_t  : 2;
  uint32_t ssde : 1;
  uint32_t  : 3;
  uint32_t mssen : 1;
  uint32_t amode : 2;
  uint32_t  : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC0_SPI_DBGCTRL	MMIO_REG(0x42000830, uint8_t)
#define SC0_SPI_DBGCTRL_DBGSTOP	(1 << 0)

#define SC0_SPI_DBGCTRL_s    MMIO_REG(0x42000830, struct __struct_SC0_SPI_DBGCTRL)
struct __struct_SC0_SPI_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC0_SPI_BAUD	MMIO_REG(0x4200080C, uint8_t)
#define SC0_SPI_BAUD_BAUD(x)	((x) << 0)
#define SC0_SPI_BAUD_BAUD_MSK	0x000000ff
#define SC0_SPI_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)

#define SC0_SPI_BAUD_s    MMIO_REG(0x4200080C, struct __struct_SC0_SPI_BAUD)
struct __struct_SC0_SPI_BAUD
{
  uint8_t baud : 8;
};

#define SC0_SPI_INTENCLR	MMIO_REG(0x42000814, uint8_t)
#define SC0_SPI_INTENCLR_DRE	(1 << 0)
#define SC0_SPI_INTENCLR_TXC	(1 << 1)
#define SC0_SPI_INTENCLR_RXC	(1 << 2)

#define SC0_SPI_INTENCLR_s    MMIO_REG(0x42000814, struct __struct_SC0_SPI_INTENCLR)
struct __struct_SC0_SPI_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC0_SPI_INTENSET	MMIO_REG(0x42000816, uint8_t)
#define SC0_SPI_INTENSET_DRE	(1 << 0)
#define SC0_SPI_INTENSET_TXC	(1 << 1)
#define SC0_SPI_INTENSET_RXC	(1 << 2)

#define SC0_SPI_INTENSET_s    MMIO_REG(0x42000816, struct __struct_SC0_SPI_INTENSET)
struct __struct_SC0_SPI_INTENSET
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC0_SPI_INTFLAG	MMIO_REG(0x42000818, uint8_t)
#define SC0_SPI_INTFLAG_DRE	(1 << 0)
#define SC0_SPI_INTFLAG_TXC	(1 << 1)
#define SC0_SPI_INTFLAG_RXC	(1 << 2)

#define SC0_SPI_INTFLAG_s    MMIO_REG(0x42000818, struct __struct_SC0_SPI_INTFLAG)
struct __struct_SC0_SPI_INTFLAG
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t ssl : 1;
  uint8_t  : 3;
  uint8_t error : 1;
};

#define SC0_SPI_STATUS	MMIO_REG(0x4200081A, uint16_t)
#define SC0_SPI_STATUS_BUFOVF	(1 << 2)


#define SC0_SPI_STATUS_s    MMIO_REG(0x4200081A, struct __struct_SC0_SPI_STATUS)
struct __struct_SC0_SPI_STATUS
{
  uint16_t  : 2;
  uint16_t bufovf : 1;
  uint16_t  : 13;
};

#define SC0_SPI_SYNCBUSY  MMIO_REG(0x4200081C, uint32_t)
#define SC0_SPI_SYNCBUSY_SWRST (1 << 0)
#define SC0_SPI_SYNCBUSY_ENABLE (1 << 1)
#define SC0_SPI_SYNCBUSY_CTRLB (1 << 2)

#define SC0_SPI_SYNCBUSY_s    MMIO_REG(0x4200081C, struct __struct_SC0_SPI_STATUS)
struct __struct_SC0_SPI_SYNCBUSY
{
  uint32_t  swrst: 1;
  uint32_t enable : 1;
  uint32_t ctrlb : 1;
  uint32_t  : 29;
};

#define SC0_SPI_ADDR	MMIO_REG(0x42000824, uint32_t)
#define SC0_SPI_ADDR_ADDR(x)	((x) << 0)
#define SC0_SPI_ADDR_ADDR_MSK	0x000000ff
#define SC0_SPI_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)
#define SC0_SPI_ADDR_ADDRMASK(x)	((x) << 16)
#define SC0_SPI_ADDR_ADDRMASK_MSK	0x00ff0000
#define SC0_SPI_ADDR_ADDRMASK_VAL(x)	(((x) >> 16) & 0xff)

#define SC0_SPI_ADDR_s    MMIO_REG(0x42000824, struct __struct_SC0_SPI_ADDR)
struct __struct_SC0_SPI_ADDR
{
  uint32_t addr : 8;
  uint32_t  : 8;
  uint32_t addrmask : 8;
  uint32_t  : 8;
};

#define SC0_SPI_DATA	MMIO_REG(0x42000828, uint16_t)
#define SC0_SPI_DATA_DATA(x)	((x) << 0)
#define SC0_SPI_DATA_DATA_MSK	0x000001ff
#define SC0_SPI_DATA_DATA_VAL(x)	(((x) >> 0) & 0x1ff)

#define SC0_SPI_DATA_s    MMIO_REG(0x42000828, struct __struct_SC0_SPI_DATA)
struct __struct_SC0_SPI_DATA
{
  uint16_t data : 9;
  uint16_t  : 7;
};

// 0x42000800 SC0_I2C_S

