cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define SC0_I2C_M_DBGCTRL_s    MMIO_REG(0x42000808, struct __struct_SC0_I2C_M_DBGCTRL)
struct __struct_SC0_I2C_M_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC0_I2C_M_BAUD	MMIO_REG(0x4200080a, uint16_t)
#define SC0_I2C_M_BAUD_BAUD(x)	((x) << 0)
#define SC0_I2C_M_BAUD_BAUD_MSK	0x000000ff
#define SC0_I2C_M_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)
#define SC0_I2C_M_BAUD_BAUDLOW(x)	((x) << 8)
#define SC0_I2C_M_BAUD_BAUDLOW_MSK	0x0000ff00
#define SC0_I2C_M_BAUD_BAUDLOW_VAL(x)	(((x) >> 8) & 0xff)

#define SC0_I2C_M_BAUD_s    MMIO_REG(0x4200080a, struct __struct_SC0_I2C_M_BAUD)
struct __struct_SC0_I2C_M_BAUD
{
  uint32_t baud : 8;
  uint32_t baudlow : 8;
  uint32_t hsbaud : 8;
  uint32_t hsbaudlow : 8;
};

#define SC0_I2C_M_INTENCLR	MMIO_REG(0x4200080c, uint8_t)
#define SC0_I2C_M_INTENCLR_MB	(1 << 0)
#define SC0_I2C_M_INTENCLR_SB	(1 << 1)

#define SC0_I2C_M_INTENCLR_s    MMIO_REG(0x4200080c, struct __struct_SC0_I2C_M_INTENCLR)
struct __struct_SC0_I2C_M_INTENCLR
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 5;
  uint8_t error : 1;
};

#define SC0_I2C_M_INTENSET	MMIO_REG(0x4200080d, uint8_t)
#define SC0_I2C_M_INTENSET_MB	(1 << 0)
#define SC0_I2C_M_INTENSET_SB	(1 << 1)

#define SC0_I2C_M_INTENSET_s    MMIO_REG(0x4200080d, struct __struct_SC0_I2C_M_INTENSET)
struct __struct_SC0_I2C_M_INTENSET
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 5;
  uint8_t error : 1;
};

#define SC0_I2C_M_INTFLAG	MMIO_REG(0x4200080e, uint8_t)
#define SC0_I2C_M_INTFLAG_MB	(1 << 0)
#define SC0_I2C_M_INTFLAG_SB	(1 << 1)

#define SC0_I2C_M_INTFLAG_s    MMIO_REG(0x4200080e, struct __struct_SC0_I2C_M_INTFLAG)
struct __struct_SC0_I2C_M_INTFLAG
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 5;
  uint8_t error : 1;
};

#define SC0_I2C_M_STATUS	MMIO_REG(0x42000810, uint16_t)
#define SC0_I2C_M_STATUS_BUSERR	(1 << 0)
#define SC0_I2C_M_STATUS_ARBLOST	(1 << 1)
#define SC0_I2C_M_STATUS_RXNACK	(1 << 2)
#define SC0_I2C_M_STATUS_BUSSTATE(x)	((x) << 4)
#define SC0_I2C_M_STATUS_BUSSTATE_MSK	0x00000030
#define SC0_I2C_M_STATUS_BUSSTATE_VAL(x)	(((x) >> 4) & 0x3)
#define SC0_I2C_M_STATUS_LOWTOUT	(1 << 6)
#define SC0_I2C_M_STATUS_CLKHOLD	(1 << 7)
#define SC0_I2C_M_STATUS_SYNCBUSY	(1 << 15)

#define SC0_I2C_M_STATUS_s    MMIO_REG(0x42000810, struct __struct_SC0_I2C_M_STATUS)
struct __struct_SC0_I2C_M_STATUS
{
  uint16_t buserr : 1;
  uint16_t arblost : 1;
  uint16_t rxnack : 1;
  uint16_t  : 1;
  uint16_t busstate : 2;
  uint16_t lowtout : 1;
  uint16_t clkhold : 1;
  uint16_t mexttout : 1;
  uint16_t sexttout : 1;
  uint16_t lenerr : 1;
  uint16_t  : 5;
};

#define SC0_I2C_M_ADDR	MMIO_REG(0x42000814, uint16_t)
#define SC0_I2C_M_ADDR_ADDR(x)	((x) << 0)
#define SC0_I2C_M_ADDR_ADDR_MSK	0x000000ff
#define SC0_I2C_M_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)

#define SC0_I2C_M_ADDR_s    MMIO_REG(0x42000814, struct __struct_SC0_I2C_M_ADDR)
struct __struct_SC0_I2C_M_ADDR
{
  uint16_t len : 8;
  uint16_t  : 8;
};

#define SC0_I2C_M_DATA	MMIO_REG(0x42000818, uint16_t)
#define SC0_I2C_M_DATA_DATA(x)	((x) << 0)
#define SC0_I2C_M_DATA_DATA_MSK	0x000000ff
#define SC0_I2C_M_DATA_DATA_VAL(x)	(((x) >> 0) & 0xff)

#define SC0_I2C_M_DATA_s    MMIO_REG(0x42000818, struct __struct_SC0_I2C_M_DATA)
struct __struct_SC0_I2C_M_DATA
{
  uint16_t data : 8;
  uint16_t  : 8;
};

// 0x42000c00 SC1_USART

#define SC1_USART_CTRLA MMIO_REG(0x42000c00, uint32_t)
#define SC1_USART_CTRLA_SWRST (1 << 0)
#define SC1_USART_CTRLA_ENABLE  (1 << 1)
#define SC1_USART_CTRLA_MODE(x) ((x) << 2)
#define SC1_USART_CTRLA_MODE_MSK  0x0000001c
#define SC1_USART_CTRLA_MODE_VAL(x) (((x) >> 2) & 0x7)
#define SC1_USART_CTRLA_RUNSTDBY  (1 << 7)
#define SC1_USART_CTRLA_TXPO  (1 << 16)
#define SC1_USART_CTRLA_RXPO(x) ((x) << 20)
#define SC1_USART_CTRLA_RXPO_MSK  0x00300000
#define SC1_USART_CTRLA_RXPO_VAL(x) (((x) >> 20) & 0x3)
#define SC1_USART_CTRLA_FORM(x) ((x) << 24)
#define SC1_USART_CTRLA_FORM_MSK  0x0f000000
#define SC1_USART_CTRLA_FORM_VAL(x) (((x) >> 24) & 0xf)
#define SC1_USART_CTRLA_CMODE (1 << 28)
#define SC1_USART_CTRLA_CPOL  (1 << 29)
#define SC1_USART_CTRLA_DORD  (1 << 30)

#define SC1_USART_CTRLA_s    MMIO_REG(0x42000c00, struct __struct_SC1_USART_CTRLA)
struct __struct_SC1_USART_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t ibon : 1;
  uint32_t  : 4;
  uint32_t sampr : 3;
  uint32_t txpo : 2;
  uint32_t  : 2;
  uint32_t rxpo : 2;
  uint32_t sampa : 2;
  uint32_t form : 4;
  uint32_t cmode : 1;
  uint32_t cpol : 1;
  uint32_t dord : 1;
  uint32_t  : 1;
};

#define SC1_USART_CTRLB MMIO_REG(0x42000c04, uint32_t)
#define SC1_USART_CTRLB_CHSIZE(x) ((x) << 0)
#define SC1_USART_CTRLB_CHSIZE_MSK  0x00000007
#define SC1_USART_CTRLB_CHSIZE_VAL(x) (((x) >> 0) & 0x7)
#define SC1_USART_CTRLB_SBMODE  (1 << 6)
#define SC1_USART_CTRLB_PMODE (1 << 13)
#define SC1_USART_CTRLB_TXEN  (1 << 16)
#define SC1_USART_CTRLB_RXEN  (1 << 17)

#define SC1_USART_CTRLB_s    MMIO_REG(0x42000c04, struct __struct_SC1_USART_CTRLB)
struct __struct_SC1_USART_CTRLB
{
  uint32_t chsize : 3;
  uint32_t  : 3;
  uint32_t sbmode : 1;
  uint32_t  : 1;
  uint32_t colden : 1;
  uint32_t sfde : 1;
  uint32_t enc : 1;
  uint32_t  : 2;
  uint32_t pmode : 1;
  uint32_t  : 2;
  uint32_t txen : 1;
  uint32_t rxen : 1;
  uint32_t  : 14;
};

#define SC1_USART_DBGCTRL MMIO_REG(0x42000c30, uint8_t)
#define SC1_USART_DBGCTRL_DBGSTOP (1 << 0)

#define SC1_USART_DBGCTRL_s    MMIO_REG(0x42000c30, struct __struct_SC1_USART_DBGCTRL)
struct __struct_SC1_USART_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC1_USART_BAUD  MMIO_REG(0x42000c0c, uint16_t)
#define SC1_USART_BAUD_BAUD(x)  ((x) << 0)
#define SC1_USART_BAUD_BAUD_MSK 0x0000ffff
#define SC1_USART_BAUD_BAUD_VAL(x)  (((x) >> 0) & 0xffff)

#define SC1_USART_BAUD_s    MMIO_REG(0x42000c0c, struct __struct_SC1_USART_BAUD)
struct __struct_SC1_USART_BAUD
{
  uint16_t baud : 16;
};

#define SC1_USART_INTENCLR  MMIO_REG(0x42000c14, uint8_t)
#define SC1_USART_INTENCLR_DRE  (1 << 0)
#define SC1_USART_INTENCLR_TXC  (1 << 1)
#define SC1_USART_INTENCLR_RXC  (1 << 2)

#define SC1_USART_INTENCLR_s    MMIO_REG(0x42000c14, struct __struct_SC1_USART_INTENCLR)
struct __struct_SC1_USART_INTENCLR
{
  uint8_t dre : 1;
  uint8_t txc : 1;
  uint8_t rxc : 1;
  uint8_t rxs : 1;
  uint8_t ctsic : 1;
  uint8_t rxbrk : 1;
  uint8_t  : 1;
  uint8_t error : 1;
};

