cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define SC2_I2C_S_DATA_s    MMIO_REG(0x42001018, struct __struct_SC2_I2C_S_DATA)
struct __struct_SC2_I2C_S_DATA
{
  uint16_t data : 8;
  uint16_t  : 8;
};

// 0x42001000 SC2_I2C_M

#define SC2_I2C_M_CTRLA	MMIO_REG(0x42001000, uint32_t)
#define SC2_I2C_M_CTRLA_SWRST	(1 << 0)
#define SC2_I2C_M_CTRLA_ENABLE	(1 << 1)
#define SC2_I2C_M_CTRLA_MODE(x)	((x) << 2)
#define SC2_I2C_M_CTRLA_MODE_MSK	0x0000001c
#define SC2_I2C_M_CTRLA_MODE_VAL(x)	(((x) >> 2) & 0x7)
#define SC2_I2C_M_CTRLA_RUNSTDBY	(1 << 7)
#define SC2_I2C_M_CTRLA_PINOUT	(1 << 16)
#define SC2_I2C_M_CTRLA_SDAHOLD(x)	((x) << 20)
#define SC2_I2C_M_CTRLA_SDAHOLD_MSK	0x00300000
#define SC2_I2C_M_CTRLA_SDAHOLD_VAL(x)	(((x) >> 20) & 0x3)
#define SC2_I2C_M_CTRLA_INACTOUT(x)	((x) << 28)
#define SC2_I2C_M_CTRLA_INACTOUT_MSK	0x30000000
#define SC2_I2C_M_CTRLA_INACTOUT_VAL(x)	(((x) >> 28) & 0x3)
#define SC2_I2C_M_CTRLA_LOWTOUT	(1 << 30)

#define SC2_I2C_M_CTRLA_s    MMIO_REG(0x42001000, struct __struct_SC2_I2C_M_CTRLA)
struct __struct_SC2_I2C_M_CTRLA
{
  uint32_t swrst : 1;
  uint32_t enable : 1;
  uint32_t mode : 3;
  uint32_t  : 2;
  uint32_t runstdby : 1;
  uint32_t  : 8;
  uint32_t pinout : 1;
  uint32_t  : 3;
  uint32_t sdahold : 2;
  uint32_t mexttoen : 2;
  uint32_t sexttoen : 2;
  uint32_t speed : 2;
  uint32_t  : 1;
  uint32_t  sclsm: 1;
  uint32_t inactout : 2;
  uint32_t lowtout : 1;
  uint32_t  : 1;
};

#define SC2_I2C_M_CTRLB	MMIO_REG(0x42001004, uint32_t)
#define SC2_I2C_M_CTRLB_SMEN	(1 << 8)
#define SC2_I2C_M_CTRLB_QCEN	(1 << 9)
#define SC2_I2C_M_CTRLB_CMD(x)	((x) << 16)
#define SC2_I2C_M_CTRLB_CMD_MSK	0x00030000
#define SC2_I2C_M_CTRLB_CMD_VAL(x)	(((x) >> 16) & 0x3)
#define SC2_I2C_M_CTRLB_ACKACT	(1 << 18)

#define SC2_I2C_M_CTRLB_s    MMIO_REG(0x42001004, struct __struct_SC2_I2C_M_CTRLB)
struct __struct_SC2_I2C_M_CTRLB
{
  uint32_t  : 8;
  uint32_t smen : 1;
  uint32_t qcen : 1;
  uint32_t  : 6;
  uint32_t cmd : 2;
  uint32_t ackact : 1;
  uint32_t  : 13;
};

#define SC2_I2C_M_DBGCTRL	MMIO_REG(0x42001008, uint8_t)
#define SC2_I2C_M_DBGCTRL_DBGSTOP	(1 << 0)

#define SC2_I2C_M_DBGCTRL_s    MMIO_REG(0x42001008, struct __struct_SC2_I2C_M_DBGCTRL)
struct __struct_SC2_I2C_M_DBGCTRL
{
  uint8_t dbgstop : 1;
  uint8_t  : 7;
};

#define SC2_I2C_M_BAUD	MMIO_REG(0x4200100a, uint16_t)
#define SC2_I2C_M_BAUD_BAUD(x)	((x) << 0)
#define SC2_I2C_M_BAUD_BAUD_MSK	0x000000ff
#define SC2_I2C_M_BAUD_BAUD_VAL(x)	(((x) >> 0) & 0xff)
#define SC2_I2C_M_BAUD_BAUDLOW(x)	((x) << 8)
#define SC2_I2C_M_BAUD_BAUDLOW_MSK	0x0000ff00
#define SC2_I2C_M_BAUD_BAUDLOW_VAL(x)	(((x) >> 8) & 0xff)

#define SC2_I2C_M_BAUD_s    MMIO_REG(0x4200100a, struct __struct_SC2_I2C_M_BAUD)
struct __struct_SC2_I2C_M_BAUD
{
  uint32_t baud : 8;
  uint32_t baudlow : 8;
  uint32_t hsbaud : 8;
  uint32_t hsbaudlow : 8;
};

#define SC2_I2C_M_INTENCLR	MMIO_REG(0x4200100c, uint8_t)
#define SC2_I2C_M_INTENCLR_MB	(1 << 0)
#define SC2_I2C_M_INTENCLR_SB	(1 << 1)

#define SC2_I2C_M_INTENCLR_s    MMIO_REG(0x4200100c, struct __struct_SC2_I2C_M_INTENCLR)
struct __struct_SC2_I2C_M_INTENCLR
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 5;
  uint8_t error : 1;
};

#define SC2_I2C_M_INTENSET	MMIO_REG(0x4200100d, uint8_t)
#define SC2_I2C_M_INTENSET_MB	(1 << 0)
#define SC2_I2C_M_INTENSET_SB	(1 << 1)

#define SC2_I2C_M_INTENSET_s    MMIO_REG(0x4200100d, struct __struct_SC2_I2C_M_INTENSET)
struct __struct_SC2_I2C_M_INTENSET
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 5;
  uint8_t error : 1;
};

#define SC2_I2C_M_INTFLAG	MMIO_REG(0x4200100e, uint8_t)
#define SC2_I2C_M_INTFLAG_MB	(1 << 0)
#define SC2_I2C_M_INTFLAG_SB	(1 << 1)

#define SC2_I2C_M_INTFLAG_s    MMIO_REG(0x4200100e, struct __struct_SC2_I2C_M_INTFLAG)
struct __struct_SC2_I2C_M_INTFLAG
{
  uint8_t mb : 1;
  uint8_t sb : 1;
  uint8_t  : 5;
  uint8_t error : 1;
};

#define SC2_I2C_M_STATUS	MMIO_REG(0x42001010, uint16_t)
#define SC2_I2C_M_STATUS_BUSERR	(1 << 0)
#define SC2_I2C_M_STATUS_ARBLOST	(1 << 1)
#define SC2_I2C_M_STATUS_RXNACK	(1 << 2)
#define SC2_I2C_M_STATUS_BUSSTATE(x)	((x) << 4)
#define SC2_I2C_M_STATUS_BUSSTATE_MSK	0x00000030
#define SC2_I2C_M_STATUS_BUSSTATE_VAL(x)	(((x) >> 4) & 0x3)
#define SC2_I2C_M_STATUS_LOWTOUT	(1 << 6)
#define SC2_I2C_M_STATUS_CLKHOLD	(1 << 7)
#define SC2_I2C_M_STATUS_SYNCBUSY	(1 << 15)

#define SC2_I2C_M_STATUS_s    MMIO_REG(0x42001010, struct __struct_SC2_I2C_M_STATUS)
struct __struct_SC2_I2C_M_STATUS
{
  uint16_t buserr : 1;
  uint16_t arblost : 1;
  uint16_t rxnack : 1;
  uint16_t  : 1;
  uint16_t busstate : 2;
  uint16_t lowtout : 1;
  uint16_t clkhold : 1;
  uint16_t mexttout : 1;
  uint16_t sexttout : 1;
  uint16_t lenerr : 1;
  uint16_t  : 5;
};

#define SC2_I2C_M_ADDR	MMIO_REG(0x42001014, uint16_t)
#define SC2_I2C_M_ADDR_ADDR(x)	((x) << 0)
#define SC2_I2C_M_ADDR_ADDR_MSK	0x000000ff
#define SC2_I2C_M_ADDR_ADDR_VAL(x)	(((x) >> 0) & 0xff)

#define SC2_I2C_M_ADDR_s    MMIO_REG(0x42001014, struct __struct_SC2_I2C_M_ADDR)
struct __struct_SC2_I2C_M_ADDR
{
  uint16_t len : 8;
  uint16_t  : 8;
};

#define SC2_I2C_M_DATA	MMIO_REG(0x42001018, uint16_t)
#define SC2_I2C_M_DATA_DATA(x)	((x) << 0)
#define SC2_I2C_M_DATA_DATA_MSK	0x000000ff
#define SC2_I2C_M_DATA_DATA_VAL(x)	(((x) >> 0) & 0xff)

#define SC2_I2C_M_DATA_s    MMIO_REG(0x42001018, struct __struct_SC2_I2C_M_DATA)
struct __struct_SC2_I2C_M_DATA
{
  uint16_t data : 8;
  uint16_t  : 8;
};

// 0x42001400 SC3_USART

#define SC3_USART_CTRLA MMIO_REG(0x42001400, uint32_t)
#define SC3_USART_CTRLA_SWRST (1 << 0)
#define SC3_USART_CTRLA_ENABLE  (1 << 1)
#define SC3_USART_CTRLA_MODE(x) ((x) << 2)
#define SC3_USART_CTRLA_MODE_MSK  0x0000001c
#define SC3_USART_CTRLA_MODE_VAL(x) (((x) >> 2) & 0x7)
#define SC3_USART_CTRLA_RUNSTDBY  (1 << 7)
#define SC3_USART_CTRLA_TXPO  (1 << 16)
#define SC3_USART_CTRLA_RXPO(x) ((x) << 20)
#define SC3_USART_CTRLA_RXPO_MSK  0x00300000
#define SC3_USART_CTRLA_RXPO_VAL(x) (((x) >> 20) & 0x3)
#define SC3_USART_CTRLA_FORM(x) ((x) << 24)
#define SC3_USART_CTRLA_FORM_MSK  0x0f000000
#define SC3_USART_CTRLA_FORM_VAL(x) (((x) >> 24) & 0xf)
#define SC3_USART_CTRLA_CMODE (1 << 28)
#define SC3_USART_CTRLA_CPOL  (1 << 29)
#define SC3_USART_CTRLA_DORD  (1 << 30)

