cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define TC7_32_INTFLAG	MMIO_REG(0x42003c0e, uint8_t)
#define TC7_32_INTFLAG_OVF	(1 << 0)
#define TC7_32_INTFLAG_ERR	(1 << 1)
#define TC7_32_INTFLAG_SYNCRDY	(1 << 3)
#define TC7_32_INTFLAG_MC0	(1 << 4)
#define TC7_32_INTFLAG_MC1	(1 << 5)

#define TC7_32_INTFLAG_s    MMIO_REG(0x42003c0e, struct __struct_TC7_32_INTFLAG)
struct __struct_TC7_32_INTFLAG
{
  uint8_t ovf : 1;
  uint8_t err : 1;
  uint8_t  : 1;
  uint8_t syncrdy : 1;
  uint8_t mc0 : 1;
  uint8_t mc1 : 1;
  uint8_t  : 2;
};

#define TC7_32_STATUS	MMIO_REG(0x42003c0f, uint8_t)
#define TC7_32_STATUS_STOP	(1 << 3)
#define TC7_32_STATUS_SLAVE	(1 << 4)
#define TC7_32_STATUS_SYNCBUSY	(1 << 7)

#define TC7_32_STATUS_s    MMIO_REG(0x42003c0f, struct __struct_TC7_32_STATUS)
struct __struct_TC7_32_STATUS
{
  uint8_t  : 3;
  uint8_t stop : 1;
  uint8_t slave : 1;
  uint8_t  : 2;
  uint8_t syncbusy : 1;
};

#define TC7_32_COUNT	MMIO_REG(0x42003c10, uint32_t)
#define TC7_32_COUNT_COUNT(x)	((x) << 0)
#define TC7_32_COUNT_COUNT_MSK	0xffffffff
#define TC7_32_COUNT_COUNT_VAL(x)	(((x) >> 0) & 0xffffffff)

#define TC7_32_COUNT_s    MMIO_REG(0x42003c10, struct __struct_TC7_32_COUNT)
struct __struct_TC7_32_COUNT
{
  uint32_t count : 32;
};

#define TC7_32_CC0	MMIO_REG(0x42003c18, uint32_t)
#define TC7_32_CC0_CC(x)	((x) << 0)
#define TC7_32_CC0_CC_MSK	0xffffffff
#define TC7_32_CC0_CC_VAL(x)	(((x) >> 0) & 0xffffffff)

#define TC7_32_CC0_s    MMIO_REG(0x42003c18, struct __struct_TC7_32_CC0)
struct __struct_TC7_32_CC0
{
  uint32_t cc : 32;
};

#define TC7_32_CC1	MMIO_REG(0x42003c1c, uint32_t)
#define TC7_32_CC1_CC(x)	((x) << 0)
#define TC7_32_CC1_CC_MSK	0xffffffff
#define TC7_32_CC1_CC_VAL(x)	(((x) >> 0) & 0xffffffff)

#define TC7_32_CC1_s    MMIO_REG(0x42003c1c, struct __struct_TC7_32_CC1)
struct __struct_TC7_32_CC1
{
  uint32_t cc : 32;
};

// 0x42004000 ADC

#define ADC_CTRLA	MMIO_REG(0x42004000, uint8_t)
#define ADC_CTRLA_SWRST	(1 << 0)
#define ADC_CTRLA_ENABLE	(1 << 1)
#define ADC_CTRLA_RUNSTDBY	(1 << 2)

#define ADC_CTRLA_s    MMIO_REG(0x42004000, struct __struct_ADC_CTRLA)
struct __struct_ADC_CTRLA
{
  uint8_t swrst : 1;
  uint8_t enable : 1;
  uint8_t runstdby : 1;
  uint8_t  : 5;
};

#define ADC_REFCTRL	MMIO_REG(0x42004001, uint8_t)
#define ADC_REFCTRL_REFSEL(x)	((x) << 0)
#define ADC_REFCTRL_REFSEL_MSK	0x0000000f
#define ADC_REFCTRL_REFSEL_VAL(x)	(((x) >> 0) & 0xf)
#define ADC_REFCTRL_REFCOMP	(1 << 7)

#define ADC_REFCTRL_s    MMIO_REG(0x42004001, struct __struct_ADC_REFCTRL)
struct __struct_ADC_REFCTRL
{
  uint8_t refsel : 4;
  uint8_t  : 3;
  uint8_t refcomp : 1;
};

#define ADC_AVGCTRL	MMIO_REG(0x42004002, uint8_t)
#define ADC_AVGCTRL_SAMPLENUM(x)	((x) << 0)
#define ADC_AVGCTRL_SAMPLENUM_MSK	0x0000000f
#define ADC_AVGCTRL_SAMPLENUM_VAL(x)	(((x) >> 0) & 0xf)
#define ADC_AVGCTRL_ADJRES(x)	((x) << 4)
#define ADC_AVGCTRL_ADJRES_MSK	0x00000070
#define ADC_AVGCTRL_ADJRES_VAL(x)	(((x) >> 4) & 0x7)

#define ADC_AVGCTRL_s    MMIO_REG(0x42004002, struct __struct_ADC_AVGCTRL)
struct __struct_ADC_AVGCTRL
{
  uint8_t samplenum : 4;
  uint8_t adjres : 3;
  uint8_t  : 1;
};

#define ADC_SAMPCTRL	MMIO_REG(0x42004003, uint8_t)
#define ADC_SAMPCTRL_SAMPLEN(x)	((x) << 0)
#define ADC_SAMPCTRL_SAMPLEN_MSK	0x0000003f
#define ADC_SAMPCTRL_SAMPLEN_VAL(x)	(((x) >> 0) & 0x3f)

#define ADC_SAMPCTRL_s    MMIO_REG(0x42004003, struct __struct_ADC_SAMPCTRL)
struct __struct_ADC_SAMPCTRL
{
  uint8_t samplen : 6;
  uint8_t  : 2;
};

#define ADC_CTRLB	MMIO_REG(0x42004004, uint8_t)
#define ADC_CTRLB_DIFFMODE	(1 << 0)
#define ADC_CTRLB_LEFTADJ	(1 << 1)
#define ADC_CTRLB_FREERUN	(1 << 2)
#define ADC_CTRLB_CORREN	(1 << 3)
#define ADC_CTRLB_RESSEL(x)	((x) << 4)
#define ADC_CTRLB_RESSEL_MSK	0x00000030
#define ADC_CTRLB_RESSEL_VAL(x)	(((x) >> 4) & 0x3)

#define ADC_CTRLB_s    MMIO_REG(0x42004004, struct __struct_ADC_CTRLB)
struct __struct_ADC_CTRLB
{
  uint8_t diffmode : 1;
  uint8_t leftadj : 1;
  uint8_t freerun : 1;
  uint8_t corren : 1;
  uint8_t ressel : 2;
  uint8_t  : 2;
};

#define ADC_WINCTRL	MMIO_REG(0x42004008, uint8_t)
#define ADC_WINCTRL_WINMODE(x)	((x) << 0)
#define ADC_WINCTRL_WINMODE_MSK	0x00000007
#define ADC_WINCTRL_WINMODE_VAL(x)	(((x) >> 0) & 0x7)

#define ADC_WINCTRL_s    MMIO_REG(0x42004008, struct __struct_ADC_WINCTRL)
struct __struct_ADC_WINCTRL
{
  uint8_t winmode : 3;
  uint8_t  : 5;
};

#define ADC_SWTRIG	MMIO_REG(0x4200400c, uint8_t)
#define ADC_SWTRIG_FLUSH	(1 << 0)
#define ADC_SWTRIG_START	(1 << 1)

#define ADC_SWTRIG_s    MMIO_REG(0x4200400c, struct __struct_ADC_SWTRIG)
struct __struct_ADC_SWTRIG
{
  uint8_t flush : 1;
  uint8_t start : 1;
  uint8_t  : 6;
};

#define ADC_INPUTCTRL	MMIO_REG(0x42004010, uint32_t)
#define ADC_INPUTCTRL_MUXPOS(x)	((x) << 0)
#define ADC_INPUTCTRL_MUXPOS_MSK	0x0000001f
#define ADC_INPUTCTRL_MUXPOS_VAL(x)	(((x) >> 0) & 0x1f)
#define ADC_INPUTCTRL_MUXNEG(x)	((x) << 8)
#define ADC_INPUTCTRL_MUXNEG_MSK	0x00001f00
#define ADC_INPUTCTRL_MUXNEG_VAL(x)	(((x) >> 8) & 0x1f)
#define ADC_INPUTCTRL_INPUTSCAN(x)	((x) << 16)
#define ADC_INPUTCTRL_INPUTSCAN_MSK	0x000f0000
#define ADC_INPUTCTRL_INPUTSCAN_VAL(x)	(((x) >> 16) & 0xf)
#define ADC_INPUTCTRL_INPUTOFFSET(x)	((x) << 20)
#define ADC_INPUTCTRL_INPUTOFFSET_MSK	0x00f00000
#define ADC_INPUTCTRL_INPUTOFFSET_VAL(x)	(((x) >> 20) & 0xf)
#define ADC_INPUTCTRL_GAIN(x)	((x) << 24)
#define ADC_INPUTCTRL_GAIN_MSK	0x0f000000
#define ADC_INPUTCTRL_GAIN_VAL(x)	(((x) >> 24) & 0xf)

#define ADC_INPUTCTRL_s    MMIO_REG(0x42004010, struct __struct_ADC_INPUTCTRL)
struct __struct_ADC_INPUTCTRL
{
  uint32_t muxpos : 5;
  uint32_t  : 3;
  uint32_t muxneg : 5;
  uint32_t  : 3;
  uint32_t inputscan : 4;
  uint32_t inputoffset : 4;
  uint32_t gain : 4;
  uint32_t  : 4;
};

#define ADC_EVCTRL	MMIO_REG(0x42004014, uint8_t)
#define ADC_EVCTRL_STARTEI	(1 << 0)
#define ADC_EVCTRL_SYNCEI	(1 << 1)
#define ADC_EVCTRL_RESDRYEO	(1 << 4)
#define ADC_EVCTRL_WINMONEO	(1 << 5)

#define ADC_EVCTRL_s    MMIO_REG(0x42004014, struct __struct_ADC_EVCTRL)
struct __struct_ADC_EVCTRL
{
  uint8_t startei : 1;
  uint8_t syncei : 1;
  uint8_t  : 2;
  uint8_t resdryeo : 1;
  uint8_t winmoneo : 1;
  uint8_t  : 2;
};

#define ADC_INTENCLR	MMIO_REG(0x42004016, uint8_t)
#define ADC_INTENCLR_RESRDY	(1 << 0)
#define ADC_INTENCLR_OVERRUN	(1 << 1)
#define ADC_INTENCLR_WINMON	(1 << 2)
#define ADC_INTENCLR_SYNCRDY	(1 << 3)

#define ADC_INTENCLR_s    MMIO_REG(0x42004016, struct __struct_ADC_INTENCLR)
struct __struct_ADC_INTENCLR
{
  uint8_t resrdy : 1;
  uint8_t overrun : 1;
  uint8_t winmon : 1;
  uint8_t syncrdy : 1;
  uint8_t  : 4;
};

#define ADC_INTENSET	MMIO_REG(0x42004017, uint8_t)
#define ADC_INTENSET_RESRDY	(1 << 0)
#define ADC_INTENSET_OVERRUN	(1 << 1)
#define ADC_INTENSET_WINMON	(1 << 2)
#define ADC_INTENSET_SYNCRDY	(1 << 3)

