cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define AC_STATUSB_s    MMIO_REG(0x42004409, struct __struct_AC_STATUSB)
struct __struct_AC_STATUSB
{
  uint8_t ready0 : 1;
  uint8_t ready1 : 1;
  uint8_t  : 5;
  uint8_t syncbusy : 1;
};

#define AC_STATUSC	MMIO_REG(0x4200440a, uint8_t)
#define AC_STATUSC_STATE0	(1 << 0)
#define AC_STATUSC_STATE1	(1 << 1)
#define AC_STATUSC_WSTATE0(x)	((x) << 4)
#define AC_STATUSC_WSTATE0_MSK	0x00000030
#define AC_STATUSC_WSTATE0_VAL(x)	(((x) >> 4) & 0x3)

#define AC_STATUSC_s    MMIO_REG(0x4200440a, struct __struct_AC_STATUSC)
struct __struct_AC_STATUSC
{
  uint8_t state0 : 1;
  uint8_t state1 : 1;
  uint8_t  : 2;
  uint8_t wstate0 : 2;
  uint8_t  : 2;
};

#define AC_WINCTRL	MMIO_REG(0x4200440c, uint8_t)
#define AC_WINCTRL_WEN0	(1 << 0)
#define AC_WINCTRL_WINTSEL0(x)	((x) << 1)
#define AC_WINCTRL_WINTSEL0_MSK	0x00000006
#define AC_WINCTRL_WINTSEL0_VAL(x)	(((x) >> 1) & 0x3)

#define AC_WINCTRL_s    MMIO_REG(0x4200440c, struct __struct_AC_WINCTRL)
struct __struct_AC_WINCTRL
{
  uint8_t wen0 : 1;
  uint8_t wintsel0 : 2;
  uint8_t  : 5;
};

#define AC_COMPCTRL0	MMIO_REG(0x42004410, uint32_t)
#define AC_COMPCTRL0_ENABLE	(1 << 0)
#define AC_COMPCTRL0_SINGLE	(1 << 1)
#define AC_COMPCTRL0_SPEED(x)	((x) << 2)
#define AC_COMPCTRL0_SPEED_MSK	0x0000000c
#define AC_COMPCTRL0_SPEED_VAL(x)	(((x) >> 2) & 0x3)
#define AC_COMPCTRL0_INTSEL(x)	((x) << 5)
#define AC_COMPCTRL0_INTSEL_MSK	0x00000060
#define AC_COMPCTRL0_INTSEL_VAL(x)	(((x) >> 5) & 0x3)
#define AC_COMPCTRL0_MUXNEG(x)	((x) << 8)
#define AC_COMPCTRL0_MUXNEG_MSK	0x00000700
#define AC_COMPCTRL0_MUXNEG_VAL(x)	(((x) >> 8) & 0x7)
#define AC_COMPCTRL0_MUXPOS(x)	((x) << 12)
#define AC_COMPCTRL0_MUXPOS_MSK	0x00003000
#define AC_COMPCTRL0_MUXPOS_VAL(x)	(((x) >> 12) & 0x3)
#define AC_COMPCTRL0_SWAP	(1 << 15)
#define AC_COMPCTRL0_OUT(x)	((x) << 16)
#define AC_COMPCTRL0_OUT_MSK	0x00030000
#define AC_COMPCTRL0_OUT_VAL(x)	(((x) >> 16) & 0x3)
#define AC_COMPCTRL0_HYST	(1 << 19)
#define AC_COMPCTRL0_FLEN(x)	((x) << 24)
#define AC_COMPCTRL0_FLEN_MSK	0x07000000
#define AC_COMPCTRL0_FLEN_VAL(x)	(((x) >> 24) & 0x7)

#define AC_COMPCTRL0_s    MMIO_REG(0x42004410, struct __struct_AC_COMPCTRL0)
struct __struct_AC_COMPCTRL0
{
  uint32_t enable : 1;
  uint32_t single : 1;
  uint32_t speed : 2;
  uint32_t  : 1;
  uint32_t intsel : 2;
  uint32_t  : 1;
  uint32_t muxneg : 3;
  uint32_t  : 1;
  uint32_t muxpos : 2;
  uint32_t  : 1;
  uint32_t swap : 1;
  uint32_t out : 2;
  uint32_t  : 1;
  uint32_t hyst : 1;
  uint32_t  : 4;
  uint32_t flen : 3;
  uint32_t  : 5;
};

#define AC_COMPCTRL1	MMIO_REG(0x42004414, uint32_t)
#define AC_COMPCTRL1_ENABLE	(1 << 0)
#define AC_COMPCTRL1_SINGLE	(1 << 1)
#define AC_COMPCTRL1_SPEED(x)	((x) << 2)
#define AC_COMPCTRL1_SPEED_MSK	0x0000000c
#define AC_COMPCTRL1_SPEED_VAL(x)	(((x) >> 2) & 0x3)
#define AC_COMPCTRL1_INTSEL(x)	((x) << 5)
#define AC_COMPCTRL1_INTSEL_MSK	0x00000060
#define AC_COMPCTRL1_INTSEL_VAL(x)	(((x) >> 5) & 0x3)
#define AC_COMPCTRL1_MUXNEG(x)	((x) << 8)
#define AC_COMPCTRL1_MUXNEG_MSK	0x00000700
#define AC_COMPCTRL1_MUXNEG_VAL(x)	(((x) >> 8) & 0x7)
#define AC_COMPCTRL1_MUXPOS(x)	((x) << 12)
#define AC_COMPCTRL1_MUXPOS_MSK	0x00003000
#define AC_COMPCTRL1_MUXPOS_VAL(x)	(((x) >> 12) & 0x3)
#define AC_COMPCTRL1_SWAP	(1 << 15)
#define AC_COMPCTRL1_OUT(x)	((x) << 16)
#define AC_COMPCTRL1_OUT_MSK	0x00030000
#define AC_COMPCTRL1_OUT_VAL(x)	(((x) >> 16) & 0x3)
#define AC_COMPCTRL1_HYST	(1 << 19)
#define AC_COMPCTRL1_FLEN(x)	((x) << 24)
#define AC_COMPCTRL1_FLEN_MSK	0x07000000
#define AC_COMPCTRL1_FLEN_VAL(x)	(((x) >> 24) & 0x7)

#define AC_COMPCTRL1_s    MMIO_REG(0x42004414, struct __struct_AC_COMPCTRL1)
struct __struct_AC_COMPCTRL1
{
  uint32_t enable : 1;
  uint32_t single : 1;
  uint32_t speed : 2;
  uint32_t  : 1;
  uint32_t intsel : 2;
  uint32_t  : 1;
  uint32_t muxneg : 3;
  uint32_t  : 1;
  uint32_t muxpos : 2;
  uint32_t  : 1;
  uint32_t swap : 1;
  uint32_t out : 2;
  uint32_t  : 1;
  uint32_t hyst : 1;
  uint32_t  : 4;
  uint32_t flen : 3;
  uint32_t  : 5;
};

#define AC_SCALER0	MMIO_REG(0x42004420, uint8_t)
#define AC_SCALER0_VALUE(x)	((x) << 0)
#define AC_SCALER0_VALUE_MSK	0x0000001f
#define AC_SCALER0_VALUE_VAL(x)	(((x) >> 0) & 0x1f)

#define AC_SCALER0_s    MMIO_REG(0x42004420, struct __struct_AC_SCALER0)
struct __struct_AC_SCALER0
{
  uint8_t value : 5;
  uint8_t  : 3;
};

#define AC_SCALER1	MMIO_REG(0x42004421, uint8_t)
#define AC_SCALER1_VALUE(x)	((x) << 0)
#define AC_SCALER1_VALUE_MSK	0x0000001f
#define AC_SCALER1_VALUE_VAL(x)	(((x) >> 0) & 0x1f)

#define AC_SCALER1_s    MMIO_REG(0x42004421, struct __struct_AC_SCALER1)
struct __struct_AC_SCALER1
{
  uint8_t value : 5;
  uint8_t  : 3;
};

// 0x42004800 DAC

#define DAC_CTRLA	MMIO_REG(0x42004800, uint8_t)
#define DAC_CTRLA_SWRST	(1 << 0)
#define DAC_CTRLA_ENABLE	(1 << 1)
#define DAC_CTRLA_RUNSTDBY	(1 << 2)

#define DAC_CTRLA_s    MMIO_REG(0x42004800, struct __struct_DAC_CTRLA)
struct __struct_DAC_CTRLA
{
  uint8_t swrst : 1;
  uint8_t enable : 1;
  uint8_t runstdby : 1;
  uint8_t  : 5;
};

#define DAC_CTRLB	MMIO_REG(0x42004801, uint8_t)
#define DAC_CTRLB_EOEN	(1 << 0)
#define DAC_CTRLB_IOEN	(1 << 1)
#define DAC_CTRLB_LEFTADJ	(1 << 2)
#define DAC_CTRLB_VPD	(1 << 3)
#define DAC_CTRLB_REFSEL(x)	((x) << 6)
#define DAC_CTRLB_REFSEL_MSK	0x000000c0
#define DAC_CTRLB_REFSEL_VAL(x)	(((x) >> 6) & 0x3)

#define DAC_CTRLB_s    MMIO_REG(0x42004801, struct __struct_DAC_CTRLB)
struct __struct_DAC_CTRLB
{
  uint8_t eoen : 1;
  uint8_t ioen : 1;
  uint8_t leftadj : 1;
  uint8_t vpd : 1;
  uint8_t  : 2;
  uint8_t refsel : 2;
};

#define DAC_EVCTRL	MMIO_REG(0x42004802, uint8_t)
#define DAC_EVCTRL_STARTEI	(1 << 0)
#define DAC_EVCTRL_EMPTYEO	(1 << 1)

#define DAC_EVCTRL_s    MMIO_REG(0x42004802, struct __struct_DAC_EVCTRL)
struct __struct_DAC_EVCTRL
{
  uint8_t startei : 1;
  uint8_t emptyeo : 1;
  uint8_t  : 6;
};

#define DAC_TEST	MMIO_REG(0x42004803, uint8_t)
#define DAC_TEST_TESTEN	(1 << 0)

#define DAC_TEST_s    MMIO_REG(0x42004803, struct __struct_DAC_TEST)
struct __struct_DAC_TEST
{
  uint8_t testen : 1;
  uint8_t  : 7;
};

#define DAC_INTENCLR	MMIO_REG(0x42004804, uint8_t)
#define DAC_INTENCLR_UNDERRUN	(1 << 0)
#define DAC_INTENCLR_EMPTY	(1 << 1)
#define DAC_INTENCLR_SYNCRDY	(1 << 2)

#define DAC_INTENCLR_s    MMIO_REG(0x42004804, struct __struct_DAC_INTENCLR)
struct __struct_DAC_INTENCLR
{
  uint8_t underrun : 1;
  uint8_t empty : 1;
  uint8_t syncrdy : 1;
  uint8_t  : 5;
};

