cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define DAC_INTENSET	MMIO_REG(0x42004805, uint8_t)
#define DAC_INTENSET_UNDERRUN	(1 << 0)
#define DAC_INTENSET_EMPTY	(1 << 1)
#define DAC_INTENSET_SYNCRDY	(1 << 2)

#define DAC_INTENSET_s    MMIO_REG(0x42004805, struct __struct_DAC_INTENSET)
struct __struct_DAC_INTENSET
{
  uint8_t underrun : 1;
  uint8_t empty : 1;
  uint8_t syncrdy : 1;
  uint8_t  : 5;
};

#define DAC_INTFLAG	MMIO_REG(0x42004806, uint8_t)
#define DAC_INTFLAG_UNDERRUN	(1 << 0)
#define DAC_INTFLAG_EMPTY	(1 << 1)
#define DAC_INTFLAG_SYNCRDY	(1 << 2)

#define DAC_INTFLAG_s    MMIO_REG(0x42004806, struct __struct_DAC_INTFLAG)
struct __struct_DAC_INTFLAG
{
  uint8_t underrun : 1;
  uint8_t empty : 1;
  uint8_t syncrdy : 1;
  uint8_t  : 5;
};

#define DAC_STATUS	MMIO_REG(0x42004807, uint8_t)
#define DAC_STATUS_SYNCBUSY	(1 << 7)

#define DAC_STATUS_s    MMIO_REG(0x42004807, struct __struct_DAC_STATUS)
struct __struct_DAC_STATUS
{
  uint8_t  : 7;
  uint8_t syncbusy : 1;
};

#define DAC_DATA	MMIO_REG(0x42004808, uint16_t)
#define DAC_DATA_DATA(x)	((x) << 0)
#define DAC_DATA_DATA_MSK	0x000003ff
#define DAC_DATA_DATA_VAL(x)	(((x) >> 0) & 0x3ff)

#define DAC_DATA_s    MMIO_REG(0x42004808, struct __struct_DAC_DATA)
struct __struct_DAC_DATA
{
  uint16_t data : 10;
  uint16_t  : 6;
};

#define DAC_DATABUF	MMIO_REG(0x4200480c, uint16_t)
#define DAC_DATABUF_DATABUF(x)	((x) << 0)
#define DAC_DATABUF_DATABUF_MSK	0x000003ff
#define DAC_DATABUF_DATABUF_VAL(x)	(((x) >> 0) & 0x3ff)

#define DAC_DATABUF_s    MMIO_REG(0x4200480c, struct __struct_DAC_DATABUF)
struct __struct_DAC_DATABUF
{
  uint16_t databuf : 10;
  uint16_t  : 6;
};

// 0x42004c00 PTC

// 0xe000e010 SYSTICK

#define SYSTICK_CSR	MMIO_REG(0xe000e010, uint32_t)
#define SYSTICK_CSR_ENABLE	(1 << 0)
#define SYSTICK_CSR_TICKINT	(1 << 1)
#define SYSTICK_CSR_CLKSOURCE	(1 << 2)
#define SYSTICK_CSR_COUNTFLAG	(1 << 16)

#define SYSTICK_CSR_s    MMIO_REG(0xe000e010, struct __struct_SYSTICK_CSR)
struct __struct_SYSTICK_CSR
{
  uint32_t enable : 1;
  uint32_t tickint : 1;
  uint32_t clksource : 1;
  uint32_t  : 13;
  uint32_t countflag : 1;
  uint32_t  : 15;
};

#define SYSTICK_RVR	MMIO_REG(0xe000e014, uint32_t)
#define SYSTICK_RVR_RELOAD(x)	((x) << 0)
#define SYSTICK_RVR_RELOAD_MSK	0x00ffffff
#define SYSTICK_RVR_RELOAD_VAL(x)	(((x) >> 0) & 0xffffff)

#define SYSTICK_RVR_s    MMIO_REG(0xe000e014, struct __struct_SYSTICK_RVR)
struct __struct_SYSTICK_RVR
{
  uint32_t reload : 24;
  uint32_t  : 8;
};

#define SYSTICK_CVR	MMIO_REG(0xe000e018, uint32_t)
#define SYSTICK_CVR_CURRENT(x)	((x) << 0)
#define SYSTICK_CVR_CURRENT_MSK	0x00ffffff
#define SYSTICK_CVR_CURRENT_VAL(x)	(((x) >> 0) & 0xffffff)

#define SYSTICK_CVR_s    MMIO_REG(0xe000e018, struct __struct_SYSTICK_CVR)
struct __struct_SYSTICK_CVR
{
  uint32_t current : 24;
  uint32_t  : 8;
};

#define SYSTICK_CALIB	MMIO_REG(0xe000e01c, uint32_t)
#define SYSTICK_CALIB_TENMS(x)	((x) << 0)
#define SYSTICK_CALIB_TENMS_MSK	0x00ffffff
#define SYSTICK_CALIB_TENMS_VAL(x)	(((x) >> 0) & 0xffffff)
#define SYSTICK_CALIB_SCEW	(1 << 30)
#define SYSTICK_CALIB_NOREF	(1 << 31)

#define SYSTICK_CALIB_s    MMIO_REG(0xe000e01c, struct __struct_SYSTICK_CALIB)
struct __struct_SYSTICK_CALIB
{
  uint32_t tenms : 24;
  uint32_t  : 6;
  uint32_t scew : 1;
  uint32_t noref : 1;
};

// 0xe000e100 NVIC

#define NVIC_ISER	MMIO_REG(0xe000e100, uint32_t)
#define NVIC_ISER_PM	(1 << 0)
#define NVIC_ISER_SYSCTRL	(1 << 1)
#define NVIC_ISER_WDT	(1 << 2)
#define NVIC_ISER_RTC	(1 << 3)
#define NVIC_ISER_EIC	(1 << 4)
#define NVIC_ISER_NVMCTRL	(1 << 5)
#define NVIC_ISER_EVSYS	(1 << 6)
#define NVIC_ISER_SERCOM0	(1 << 7)
#define NVIC_ISER_SERCOM1	(1 << 8)
#define NVIC_ISER_SERCOM2	(1 << 9)
#define NVIC_ISER_SERCOM3	(1 << 10)
#define NVIC_ISER_SERCOM4	(1 << 11)
#define NVIC_ISER_SERCOM5	(1 << 12)
#define NVIC_ISER_TCC0	(1 << 13)
#define NVIC_ISER_TCC1	(1 << 14)
#define NVIC_ISER_TC2	(1 << 15)
#define NVIC_ISER_TC3	(1 << 16)
#define NVIC_ISER_TC4	(1 << 17)
#define NVIC_ISER_TC5	(1 << 18)
#define NVIC_ISER_TC6	(1 << 19)
#define NVIC_ISER_TC7	(1 << 20)
#define NVIC_ISER_ADC	(1 << 21)
#define NVIC_ISER_AC	(1 << 22)
#define NVIC_ISER_DAC	(1 << 23)
#define NVIC_ISER_PTC	(1 << 24)

#define NVIC_ISER_s    MMIO_REG(0xe000e100, struct __struct_NVIC_ISER)
struct __struct_NVIC_ISER
{
  uint32_t pm : 1;
  uint32_t sysctrl : 1;
  uint32_t wdt : 1;
  uint32_t rtc : 1;
  uint32_t eic : 1;
  uint32_t nvmctrl : 1;
  uint32_t dmac : 1;
  uint32_t usb : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t tcc0 : 1;
  uint32_t tcc1 : 1;
  uint32_t tcc2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t  : 5;
};

#define NVIC_ICER	MMIO_REG(0xe000e180, uint32_t)
#define NVIC_ICER_PM	(1 << 0)
#define NVIC_ICER_SYSCTRL	(1 << 1)
#define NVIC_ICER_WDT	(1 << 2)
#define NVIC_ICER_RTC	(1 << 3)
#define NVIC_ICER_EIC	(1 << 4)
#define NVIC_ICER_NVMCTRL	(1 << 5)
#define NVIC_ICER_EVSYS	(1 << 6)
#define NVIC_ICER_SERCOM0	(1 << 7)
#define NVIC_ICER_SERCOM1	(1 << 8)
#define NVIC_ICER_SERCOM2	(1 << 9)
#define NVIC_ICER_SERCOM3	(1 << 10)
#define NVIC_ICER_SERCOM4	(1 << 11)
#define NVIC_ICER_SERCOM5	(1 << 12)
#define NVIC_ICER_TCC0	(1 << 13)
#define NVIC_ICER_TCC1	(1 << 14)
#define NVIC_ICER_TC2	(1 << 15)
#define NVIC_ICER_TC3	(1 << 16)
#define NVIC_ICER_TC4	(1 << 17)
#define NVIC_ICER_TC5	(1 << 18)
#define NVIC_ICER_TC6	(1 << 19)
#define NVIC_ICER_TC7	(1 << 20)
#define NVIC_ICER_ADC	(1 << 21)
#define NVIC_ICER_AC	(1 << 22)
#define NVIC_ICER_DAC	(1 << 23)
#define NVIC_ICER_PTC	(1 << 24)

#define NVIC_ICER_s    MMIO_REG(0xe000e180, struct __struct_NVIC_ICER)
struct __struct_NVIC_ICER
{
  uint32_t pm : 1;
  uint32_t sysctrl : 1;
  uint32_t wdt : 1;
  uint32_t rtc : 1;
  uint32_t eic : 1;
  uint32_t nvmctrl : 1;
  uint32_t dmac : 1;
  uint32_t usb : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t tcc0 : 1;
  uint32_t tcc1 : 1;
  uint32_t tcc2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t  : 5;
};

#define NVIC_ISPR	MMIO_REG(0xe000e200, uint32_t)
#define NVIC_ISPR_PM	(1 << 0)
#define NVIC_ISPR_SYSCTRL	(1 << 1)
#define NVIC_ISPR_WDT	(1 << 2)
#define NVIC_ISPR_RTC	(1 << 3)
#define NVIC_ISPR_EIC	(1 << 4)
#define NVIC_ISPR_NVMCTRL	(1 << 5)
#define NVIC_ISPR_EVSYS	(1 << 6)
#define NVIC_ISPR_SERCOM0	(1 << 7)
#define NVIC_ISPR_SERCOM1	(1 << 8)
#define NVIC_ISPR_SERCOM2	(1 << 9)
#define NVIC_ISPR_SERCOM3	(1 << 10)
#define NVIC_ISPR_SERCOM4	(1 << 11)
#define NVIC_ISPR_SERCOM5	(1 << 12)
#define NVIC_ISPR_TCC0	(1 << 13)
#define NVIC_ISPR_TCC1	(1 << 14)
#define NVIC_ISPR_TC2	(1 << 15)
#define NVIC_ISPR_TC3	(1 << 16)
#define NVIC_ISPR_TC4	(1 << 17)
#define NVIC_ISPR_TC5	(1 << 18)
#define NVIC_ISPR_TC6	(1 << 19)
#define NVIC_ISPR_TC7	(1 << 20)
#define NVIC_ISPR_ADC	(1 << 21)
#define NVIC_ISPR_AC	(1 << 22)
#define NVIC_ISPR_DAC	(1 << 23)
#define NVIC_ISPR_PTC	(1 << 24)

#define NVIC_ISPR_s    MMIO_REG(0xe000e200, struct __struct_NVIC_ISPR)
struct __struct_NVIC_ISPR
{
  uint32_t pm : 1;
  uint32_t sysctrl : 1;
  uint32_t wdt : 1;
  uint32_t rtc : 1;
  uint32_t eic : 1;
  uint32_t nvmctrl : 1;
  uint32_t dmac : 1;
  uint32_t usb : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t tcc0 : 1;
  uint32_t tcc1 : 1;
  uint32_t tcc2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t  : 5;
};

#define NVIC_ICPR	MMIO_REG(0xe000e280, uint32_t)
#define NVIC_ICPR_PM	(1 << 0)
#define NVIC_ICPR_SYSCTRL	(1 << 1)
#define NVIC_ICPR_WDT	(1 << 2)
#define NVIC_ICPR_RTC	(1 << 3)
#define NVIC_ICPR_EIC	(1 << 4)
#define NVIC_ICPR_NVMCTRL	(1 << 5)
#define NVIC_ICPR_EVSYS	(1 << 6)
#define NVIC_ICPR_SERCOM0	(1 << 7)
#define NVIC_ICPR_SERCOM1	(1 << 8)
#define NVIC_ICPR_SERCOM2	(1 << 9)
#define NVIC_ICPR_SERCOM3	(1 << 10)
#define NVIC_ICPR_SERCOM4	(1 << 11)
#define NVIC_ICPR_SERCOM5	(1 << 12)
#define NVIC_ICPR_TCC0	(1 << 13)
#define NVIC_ICPR_TCC1	(1 << 14)
#define NVIC_ICPR_TC2	(1 << 15)
#define NVIC_ICPR_TC3	(1 << 16)
#define NVIC_ICPR_TC4	(1 << 17)
#define NVIC_ICPR_TC5	(1 << 18)
#define NVIC_ICPR_TC6	(1 << 19)
#define NVIC_ICPR_TC7	(1 << 20)
#define NVIC_ICPR_ADC	(1 << 21)
#define NVIC_ICPR_AC	(1 << 22)
#define NVIC_ICPR_DAC	(1 << 23)
#define NVIC_ICPR_PTC	(1 << 24)

#define NVIC_ICPR_s    MMIO_REG(0xe000e280, struct __struct_NVIC_ICPR)
struct __struct_NVIC_ICPR
{
  uint32_t pm : 1;
  uint32_t sysctrl : 1;
  uint32_t wdt : 1;
  uint32_t rtc : 1;
  uint32_t eic : 1;
  uint32_t nvmctrl : 1;
  uint32_t dmac : 1;
  uint32_t usb : 1;
  uint32_t evsys : 1;
  uint32_t sercom0 : 1;
  uint32_t sercom1 : 1;
  uint32_t sercom2 : 1;
  uint32_t sercom3 : 1;
  uint32_t sercom4 : 1;
  uint32_t sercom5 : 1;
  uint32_t tcc0 : 1;
  uint32_t tcc1 : 1;
  uint32_t tcc2 : 1;
  uint32_t tc3 : 1;
  uint32_t tc4 : 1;
  uint32_t tc5 : 1;
  uint32_t tc6 : 1;
  uint32_t tc7 : 1;
  uint32_t adc : 1;
  uint32_t ac : 1;
  uint32_t dac : 1;
  uint32_t ptc : 1;
  uint32_t  : 5;
};

