cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define NVIC_IPR0	MMIO_REG(0xe000e400, uint32_t)
#define NVIC_IPR0_PM(x)	((x) << 6)
#define NVIC_IPR0_PM_MSK	0x000000c0
#define NVIC_IPR0_PM_VAL(x)	(((x) >> 6) & 0x3)
#define NVIC_IPR0_SYSCTRL(x)	((x) << 14)
#define NVIC_IPR0_SYSCTRL_MSK	0x0000c000
#define NVIC_IPR0_SYSCTRL_VAL(x)	(((x) >> 14) & 0x3)
#define NVIC_IPR0_WDT(x)	((x) << 22)
#define NVIC_IPR0_WDT_MSK	0x00c00000
#define NVIC_IPR0_WDT_VAL(x)	(((x) >> 22) & 0x3)
#define NVIC_IPR0_RTC(x)	((x) << 30)
#define NVIC_IPR0_RTC_MSK	0xc0000000
#define NVIC_IPR0_RTC_VAL(x)	(((x) >> 30) & 0x3)

#define NVIC_IPR0_s    MMIO_REG(0xe000e400, struct __struct_NVIC_IPR0)
struct __struct_NVIC_IPR0
{
  uint32_t  : 6;
  uint32_t pm : 2;
  uint32_t  : 6;
  uint32_t sysctrl : 2;
  uint32_t  : 6;
  uint32_t wdt : 2;
  uint32_t  : 6;
  uint32_t rtc : 2;
};

#define NVIC_IPR1	MMIO_REG(0xe000e404, uint32_t)
#define NVIC_IPR1_EIC(x)	((x) << 6)
#define NVIC_IPR1_EIC_MSK	0x000000c0
#define NVIC_IPR1_EIC_VAL(x)	(((x) >> 6) & 0x3)
#define NVIC_IPR1_NVMCTRL(x)	((x) << 14)
#define NVIC_IPR1_NVMCTRL_MSK	0x0000c000
#define NVIC_IPR1_NVMCTRL_VAL(x)	(((x) >> 14) & 0x3)
#define NVIC_IPR1_EVSYS(x)	((x) << 22)
#define NVIC_IPR1_EVSYS_MSK	0x00c00000
#define NVIC_IPR1_EVSYS_VAL(x)	(((x) >> 22) & 0x3)
#define NVIC_IPR1_SERCOM0(x)	((x) << 30)
#define NVIC_IPR1_SERCOM0_MSK	0xc0000000
#define NVIC_IPR1_SERCOM0_VAL(x)	(((x) >> 30) & 0x3)

#define NVIC_IPR1_s    MMIO_REG(0xe000e404, struct __struct_NVIC_IPR1)
struct __struct_NVIC_IPR1
{
  uint32_t  : 6;
  uint32_t eic : 2;
  uint32_t  : 6;
  uint32_t nvmctrl : 2;
  uint32_t  : 6;
  uint32_t evsys : 2;
  uint32_t  : 6;
  uint32_t sercom0 : 2;
};

#define NVIC_IPR2	MMIO_REG(0xe000e408, uint32_t)
#define NVIC_IPR2_SERCOM1(x)	((x) << 6)
#define NVIC_IPR2_SERCOM1_MSK	0x000000c0
#define NVIC_IPR2_SERCOM1_VAL(x)	(((x) >> 6) & 0x3)
#define NVIC_IPR2_SERCOM2(x)	((x) << 14)
#define NVIC_IPR2_SERCOM2_MSK	0x0000c000
#define NVIC_IPR2_SERCOM2_VAL(x)	(((x) >> 14) & 0x3)
#define NVIC_IPR2_SERCOM3(x)	((x) << 22)
#define NVIC_IPR2_SERCOM3_MSK	0x00c00000
#define NVIC_IPR2_SERCOM3_VAL(x)	(((x) >> 22) & 0x3)
#define NVIC_IPR2_SERCOM4(x)	((x) << 30)
#define NVIC_IPR2_SERCOM4_MSK	0xc0000000
#define NVIC_IPR2_SERCOM4_VAL(x)	(((x) >> 30) & 0x3)

#define NVIC_IPR2_s    MMIO_REG(0xe000e408, struct __struct_NVIC_IPR2)
struct __struct_NVIC_IPR2
{
  uint32_t  : 6;
  uint32_t sercom1 : 2;
  uint32_t  : 6;
  uint32_t sercom2 : 2;
  uint32_t  : 6;
  uint32_t sercom3 : 2;
  uint32_t  : 6;
  uint32_t sercom4 : 2;
};

#define NVIC_IPR3	MMIO_REG(0xe000e40c, uint32_t)
#define NVIC_IPR3_SERCOM5(x)	((x) << 6)
#define NVIC_IPR3_SERCOM5_MSK	0x000000c0
#define NVIC_IPR3_SERCOM5_VAL(x)	(((x) >> 6) & 0x3)
#define NVIC_IPR3_TCC0(x)	((x) << 14)
#define NVIC_IPR3_TCC0_MSK	0x0000c000
#define NVIC_IPR3_TCC0_VAL(x)	(((x) >> 14) & 0x3)
#define NVIC_IPR3_TCC1(x)	((x) << 22)
#define NVIC_IPR3_TCC1_MSK	0x00c00000
#define NVIC_IPR3_TCC1_VAL(x)	(((x) >> 22) & 0x3)
#define NVIC_IPR3_TC2(x)	((x) << 30)
#define NVIC_IPR3_TC2_MSK	0xc0000000
#define NVIC_IPR3_TC2_VAL(x)	(((x) >> 30) & 0x3)

#define NVIC_IPR3_s    MMIO_REG(0xe000e40c, struct __struct_NVIC_IPR3)
struct __struct_NVIC_IPR3
{
  uint32_t  : 6;
  uint32_t sercom5 : 2;
  uint32_t  : 6;
  uint32_t TCC0 : 2;
  uint32_t  : 6;
  uint32_t TCC1 : 2;
  uint32_t  : 6;
  uint32_t TCC2 : 2;
};

#define NVIC_IPR4	MMIO_REG(0xe000e410, uint32_t)
#define NVIC_IPR4_TC3(x)	((x) << 6)
#define NVIC_IPR4_TC3_MSK	0x000000c0
#define NVIC_IPR4_TC3_VAL(x)	(((x) >> 6) & 0x3)
#define NVIC_IPR4_TC4(x)	((x) << 14)
#define NVIC_IPR4_TC4_MSK	0x0000c000
#define NVIC_IPR4_TC4_VAL(x)	(((x) >> 14) & 0x3)
#define NVIC_IPR4_TC5(x)	((x) << 22)
#define NVIC_IPR4_TC5_MSK	0x00c00000
#define NVIC_IPR4_TC5_VAL(x)	(((x) >> 22) & 0x3)
#define NVIC_IPR4_TC6(x)	((x) << 30)
#define NVIC_IPR4_TC6_MSK	0xc0000000
#define NVIC_IPR4_TC6_VAL(x)	(((x) >> 30) & 0x3)

#define NVIC_IPR4_s    MMIO_REG(0xe000e410, struct __struct_NVIC_IPR4)
struct __struct_NVIC_IPR4
{
  uint32_t  : 6;
  uint32_t tc3 : 2;
  uint32_t  : 6;
  uint32_t tc4 : 2;
  uint32_t  : 6;
  uint32_t tc5 : 2;
  uint32_t  : 6;
  uint32_t tc6 : 2;
};

#define NVIC_IPR5	MMIO_REG(0xe000e414, uint32_t)
#define NVIC_IPR5_TC7(x)	((x) << 6)
#define NVIC_IPR5_TC7_MSK	0x000000c0
#define NVIC_IPR5_TC7_VAL(x)	(((x) >> 6) & 0x3)
#define NVIC_IPR5_ADC(x)	((x) << 14)
#define NVIC_IPR5_ADC_MSK	0x0000c000
#define NVIC_IPR5_ADC_VAL(x)	(((x) >> 14) & 0x3)
#define NVIC_IPR5_AC(x)	((x) << 22)
#define NVIC_IPR5_AC_MSK	0x00c00000
#define NVIC_IPR5_AC_VAL(x)	(((x) >> 22) & 0x3)
#define NVIC_IPR5_DAC(x)	((x) << 30)
#define NVIC_IPR5_DAC_MSK	0xc0000000
#define NVIC_IPR5_DAC_VAL(x)	(((x) >> 30) & 0x3)

#define NVIC_IPR5_s    MMIO_REG(0xe000e414, struct __struct_NVIC_IPR5)
struct __struct_NVIC_IPR5
{
  uint32_t  : 6;
  uint32_t tc7 : 2;
  uint32_t  : 6;
  uint32_t adc : 2;
  uint32_t  : 6;
  uint32_t ac : 2;
  uint32_t  : 6;
  uint32_t dac : 2;
};

#define NVIC_IPR6	MMIO_REG(0xe000e418, uint32_t)
#define NVIC_IPR6_PTC(x)	((x) << 6)
#define NVIC_IPR6_PTC_MSK	0x000000c0
#define NVIC_IPR6_PTC_VAL(x)	(((x) >> 6) & 0x3)

#define NVIC_IPR6_s    MMIO_REG(0xe000e418, struct __struct_NVIC_IPR6)
struct __struct_NVIC_IPR6
{
  uint32_t  : 6;
  uint32_t ptc : 2;
  uint32_t  : 6;
  uint32_t  : 2;
  uint32_t  : 6;
  uint32_t  : 2;
  uint32_t  : 6;
  uint32_t  : 2;
};

// 0xe000ed00 SCB

#define SCB_CPUID	MMIO_REG(0xe000ed00, uint32_t)
#define SCB_CPUID_REVISION(x)	((x) << 0)
#define SCB_CPUID_REVISION_MSK	0x0000000f
#define SCB_CPUID_REVISION_VAL(x)	(((x) >> 0) & 0xf)
#define SCB_CPUID_PARTNO(x)	((x) << 4)
#define SCB_CPUID_PARTNO_MSK	0x0000fff0
#define SCB_CPUID_PARTNO_VAL(x)	(((x) >> 4) & 0xfff)
#define SCB_CPUID__1100(x)	((x) << 16)
#define SCB_CPUID__1100_MSK	0x000f0000
#define SCB_CPUID__1100_VAL(x)	(((x) >> 16) & 0xf)
#define SCB_CPUID_VARIANT(x)	((x) << 20)
#define SCB_CPUID_VARIANT_MSK	0x00f00000
#define SCB_CPUID_VARIANT_VAL(x)	(((x) >> 20) & 0xf)
#define SCB_CPUID_IMPLEMENTER(x)	((x) << 24)
#define SCB_CPUID_IMPLEMENTER_MSK	0xff000000
#define SCB_CPUID_IMPLEMENTER_VAL(x)	(((x) >> 24) & 0xff)

#define SCB_CPUID_s    MMIO_REG(0xe000ed00, struct __struct_SCB_CPUID)
struct __struct_SCB_CPUID
{
  uint32_t revision : 4;
  uint32_t partno : 12;
  uint32_t _1100 : 4;
  uint32_t variant : 4;
  uint32_t implementer : 8;
};

#define SCB_ICSR	MMIO_REG(0xe000ed04, uint32_t)
#define SCB_ICSR_VECTACTIVE(x)	((x) << 0)
#define SCB_ICSR_VECTACTIVE_MSK	0x000001ff
#define SCB_ICSR_VECTACTIVE_VAL(x)	(((x) >> 0) & 0x1ff)
#define SCB_ICSR_VECTPENDING(x)	((x) << 12)
#define SCB_ICSR_VECTPENDING_MSK	0x001ff000
#define SCB_ICSR_VECTPENDING_VAL(x)	(((x) >> 12) & 0x1ff)
#define SCB_ICSR_ISRPENDING	(1 << 22)
#define SCB_ICSR_ISRPREEMPT	(1 << 23)
#define SCB_ICSR_PENDSTCLR	(1 << 25)
#define SCB_ICSR_PENDSTSET	(1 << 26)
#define SCB_ICSR_PENDSVCLR	(1 << 27)
#define SCB_ICSR_PENDSVSET	(1 << 28)
#define SCB_ICSR_NMIPENDSET	(1 << 31)

