cepawiel/OpenGDEMU/CPU/submodules/microchip-asf/thirdparty/wireless/addons/boot/bootloader/cortexm0+/include/atsamr21.h
#define SCB_ICSR_s    MMIO_REG(0xe000ed04, struct __struct_SCB_ICSR)
struct __struct_SCB_ICSR
{
  uint32_t vectactive : 9;
  uint32_t  : 3;
  uint32_t vectpending : 9;
  uint32_t  : 1;
  uint32_t isrpending : 1;
  uint32_t isrpreempt : 1;
  uint32_t  : 1;
  uint32_t pendstclr : 1;
  uint32_t pendstset : 1;
  uint32_t pendsvclr : 1;
  uint32_t pendsvset : 1;
  uint32_t  : 2;
  uint32_t nmipendset : 1;
};

#define SCB_VTOR	MMIO_REG(0xe000ed08, uint32_t)
#define SCB_VTOR_TBLOFF(x)	((x) << 7)
#define SCB_VTOR_TBLOFF_MSK	0xffffff80
#define SCB_VTOR_TBLOFF_VAL(x)	(((x) >> 7) & 0x1ffffff)

#define SCB_VTOR_s    MMIO_REG(0xe000ed08, struct __struct_SCB_VTOR)
struct __struct_SCB_VTOR
{
  uint32_t  : 7;
  uint32_t tbloff : 25;
};

#define SCB_AIRCR	MMIO_REG(0xe000ed0c, uint32_t)
#define SCB_AIRCR_VECTCLRACTIVE	(1 << 1)
#define SCB_AIRCR_SYSRESETREQ	(1 << 2)
#define SCB_AIRCR_ENDIANESS	(1 << 15)
#define SCB_AIRCR_VECTKEY(x)	((x) << 16)
#define SCB_AIRCR_VECTKEY_MSK	0xffff0000
#define SCB_AIRCR_VECTKEY_VAL(x)	(((x) >> 16) & 0xffff)

#define SCB_AIRCR_s    MMIO_REG(0xe000ed0c, struct __struct_SCB_AIRCR)
struct __struct_SCB_AIRCR
{
  uint32_t  : 1;
  uint32_t vectclractive : 1;
  uint32_t sysresetreq : 1;
  uint32_t  : 12;
  uint32_t endianess : 1;
  uint32_t vectkey : 16;
};

#define SCB_SCR	MMIO_REG(0xe000ed10, uint32_t)
#define SCB_SCR_SLEEPONEXIT	(1 << 1)
#define SCB_SCR_SLEEPDEEP	(1 << 2)
#define SCB_SCR_SEVONPEND	(1 << 4)

#define SCB_SCR_s    MMIO_REG(0xe000ed10, struct __struct_SCB_SCR)
struct __struct_SCB_SCR
{
  uint32_t  : 1;
  uint32_t sleeponexit : 1;
  uint32_t sleepdeep : 1;
  uint32_t  : 1;
  uint32_t sevonpend : 1;
  uint32_t  : 27;
};

#define SCB_CCR	MMIO_REG(0xe000ed14, uint32_t)
#define SCB_CCR_UNALIGN_TRP	(1 << 3)
#define SCB_CCR_STKALIGN	(1 << 9)

#define SCB_CCR_s    MMIO_REG(0xe000ed14, struct __struct_SCB_CCR)
struct __struct_SCB_CCR
{
  uint32_t  : 3;
  uint32_t unalign_trp : 1;
  uint32_t  : 5;
  uint32_t stkalign : 1;
  uint32_t  : 22;
};

#define SCB_SHPR2	MMIO_REG(0xe000ed1c, uint32_t)
#define SCB_SHPR2_PRI_11(x)	((x) << 30)
#define SCB_SHPR2_PRI_11_MSK	0xc0000000
#define SCB_SHPR2_PRI_11_VAL(x)	(((x) >> 30) & 0x3)

#define SCB_SHPR2_s    MMIO_REG(0xe000ed1c, struct __struct_SCB_SHPR2)
struct __struct_SCB_SHPR2
{
  uint32_t  : 30;
  uint32_t pri_11 : 2;
};

#define SCB_SHPR3	MMIO_REG(0xe000ed20, uint32_t)
#define SCB_SHPR3_PRI_14(x)	((x) << 22)
#define SCB_SHPR3_PRI_14_MSK	0x00c00000
#define SCB_SHPR3_PRI_14_VAL(x)	(((x) >> 22) & 0x3)
#define SCB_SHPR3_PRI_15(x)	((x) << 30)
#define SCB_SHPR3_PRI_15_MSK	0xc0000000
#define SCB_SHPR3_PRI_15_VAL(x)	(((x) >> 30) & 0x3)

#define SCB_SHPR3_s    MMIO_REG(0xe000ed20, struct __struct_SCB_SHPR3)
struct __struct_SCB_SHPR3
{
  uint32_t  : 22;
  uint32_t pri_14 : 2;
  uint32_t  : 6;
  uint32_t pri_15 : 2;
};

#define SCB_SHCSR	MMIO_REG(0xe000ed24, uint32_t)
#define SCB_SHCSR_SVCALLPENDED	(1 << 15)

#define SCB_SHCSR_s    MMIO_REG(0xe000ed24, struct __struct_SCB_SHCSR)
struct __struct_SCB_SHCSR
{
  uint32_t  : 15;
  uint32_t svcallpended : 1;
  uint32_t  : 16;
};

#define SCB_DFSR	MMIO_REG(0xe000ed30, uint32_t)
#define SCB_DFSR_HALTED	(1 << 0)
#define SCB_DFSR_BKPT	(1 << 1)
#define SCB_DFSR_DWTTRAP	(1 << 2)
#define SCB_DFSR_VCATCH	(1 << 3)
#define SCB_DFSR_EXTERNAL	(1 << 4)

#define SCB_DFSR_s    MMIO_REG(0xe000ed30, struct __struct_SCB_DFSR)
struct __struct_SCB_DFSR
{
  uint32_t halted : 1;
  uint32_t bkpt : 1;
  uint32_t dwttrap : 1;
  uint32_t vcatch : 1;
  uint32_t external : 1;
  uint32_t  : 27;
};
// Peripheral instances on HPB2 bridge
#define ID_PAC2          64 /**< \brief Peripheral Access Controller PAC (PAC2) */
#define ID_EVSYS         65 /**< \brief Event System Interface (EVSYS) */
#define ID_SERCOM0       66 /**< \brief Serial Communication Interface SERCOM (SERCOM0) */
#define ID_SERCOM1       67 /**< \brief Serial Communication Interface SERCOM (SERCOM1) */
#define ID_SERCOM2       68 /**< \brief Serial Communication Interface SERCOM (SERCOM2) */
#define ID_SERCOM3       69 /**< \brief Serial Communication Interface SERCOM (SERCOM3) */
#define ID_SERCOM4       70 /**< \brief Serial Communication Interface SERCOM (SERCOM4) */
#define ID_SERCOM5       71 /**< \brief Serial Communication Interface SERCOM (SERCOM5) */
#define ID_TCC0           72 /**< \brief Basic Timer Counter TC (TCC0) */
#define ID_TCC1           73 /**< \brief Basic Timer Counter TC (TCC1) */
#define ID_TC2           74 /**< \brief Basic Timer Counter TC (TCC2) */
#define ID_TC3           75 /**< \brief Basic Timer Counter TC (TC3) */
#define ID_TC4           76 /**< \brief Basic Timer Counter TC (TC4) */
#define ID_TC5           77 /**< \brief Basic Timer Counter TC (TC5) */
#define ID_TC6           78 /**< \brief Basic Timer Counter TC (TC6) */
#define ID_TC7           79 /**< \brief Basic Timer Counter TC (TC7) */
#define ID_ADC           80 /**< \brief Analog Digital Converter (ADC) */
#define ID_AC            81 /**< \brief Analog Comparators (AC) */
#define ID_DAC           82 /**< \brief Digital Analog Converter (DAC) */

#define ID_PERIPH_COUNT  83 /**< \brief Number of peripheral IDs */
/*@}*/

/* ************************************************************************** */
/**  BASE ADDRESS DEFINITIONS FOR SAMR21G18A */
/* ************************************************************************** */
/** \defgroup SAMR21G18A_base Peripheral Base Address Definitions */
/*@{*/

#if defined(__ASSEMBLY__) || defined(__IAR_SYSTEMS_ASM__)
#define AC                            (0x42004400U) /**< \brief (AC) APB Base Address */
#define ADC                           (0x42004000U) /**< \brief (ADC) APB Base Address */
#define DAC                           (0x42004800U) /**< \brief (DAC) APB Base Address */
#define DSU                           (0x41002000U) /**< \brief (DSU) APB Base Address */
#define EIC                           (0x40001800U) /**< \brief (EIC) APB Base Address */
#define EVSYS                         (0x42000400U) /**< \brief (EVSYS) APB Base Address */
#define GCLK                          (0x40000C00U) /**< \brief (GCLK) APB Base Address */
#define NVMCTRL                       (0x41004000U) /**< \brief (NVMCTRL) APB Base Address */
#define NVMCTRL_CAL                   (0x00800000U) /**< \brief (NVMCTRL) CAL Base Address */
#define NVMCTRL_LOCKBIT               (0x00802000U) /**< \brief (NVMCTRL) LOCKBIT Base Address */
#define NVMCTRL_OTP1                  (0x00806000U) /**< \brief (NVMCTRL) OTP1 Base Address */
#define NVMCTRL_OTP2                  (0x00806008U) /**< \brief (NVMCTRL) OTP2 Base Address */
#define NVMCTRL_OTP4                  (0x00806020U) /**< \brief (NVMCTRL) OTP4 Base Address */
#define NVMCTRL_USER                  (0x00804000U) /**< \brief (NVMCTRL) USER Base Address */
#define PAC0                          (0x40000000U) /**< \brief (PAC0) APB Base Address */
#define PAC1                          (0x41000000U) /**< \brief (PAC1) APB Base Address */
#define PAC2                          (0x42000000U) /**< \brief (PAC2) APB Base Address */
#define PM                            (0x40000400U) /**< \brief (PM) APB Base Address */
#define PORT                          (0x41004400U) /**< \brief (PORT) APB Base Address */
#define PORT_IOBUS                    (0x60000000U) /**< \brief (PORT) IOBUS Base Address */
#define RTC                           (0x40001400U) /**< \brief (RTC) APB Base Address */
#define SERCOM0                       (0x42000800U) /**< \brief (SERCOM0) APB Base Address */
#define SERCOM1                       (0x42000C00U) /**< \brief (SERCOM1) APB Base Address */
#define SERCOM2                       (0x42001000U) /**< \brief (SERCOM2) APB Base Address */
#define SERCOM3                       (0x42001400U) /**< \brief (SERCOM3) APB Base Address */
#define SERCOM4                       (0x42001800U) /**< \brief (SERCOM4) APB Base Address */
#define SERCOM5                       (0x42001C00U) /**< \brief (SERCOM5) APB Base Address */
#define SYSCTRL                       (0x40000800U) /**< \brief (SYSCTRL) APB Base Address */
#define TCC0                           (0x42002000U) /**< \brief (TCC0) APB Base Address */
#define TCC1                           (0x42002400U) /**< \brief (TCC1) APB Base Address */
#define TCC2                           (0x42002800U) /**< \brief (TCC2) APB Base Address */
#define TC3                           (0x42002C00U) /**< \brief (TC3) APB Base Address */
#define TC4                           (0x42003000U) /**< \brief (TC4) APB Base Address */
#define TC5                           (0x42003400U) /**< \brief (TC5) APB Base Address */
#define TC6                           (0x42003800U) /**< \brief (TC6) APB Base Address */
#define TC7                           (0x42003C00U) /**< \brief (TC7) APB Base Address */
#define WDT                           (0x40001000U) /**< \brief (WDT) APB Base Address */
#else
#define AC                ((Ac       *)0x42004400U) /**< \brief (AC) APB Base Address */
#define AC_INST_NUM       1                         /**< \brief (AC) Number of instances */
#define AC_INSTS          { AC }                    /**< \brief (AC) Instances List */

